{"endgame_checkmates": {"0": {"Event": "Chess Trainer Hub - Checkmates: Backrank Mate", "Site": "https://lichess.org/study/cRvEIzuY/wPvjKmF3", "Result": "*", "UTCDate": "2021.03.02", "UTCTime": "01:44:50", "Variant": "Standard", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "3k4/3ppp2/1Q6/8/3R4/8/2K5/8 b - - 0 1", "SetUp": "1", "pgnContent": "\n1... Ke8 { A backrank checkmate occurs when the king is on the 1st or 8th row of a chess board and checkmate is delivered. It must be given by a rook or queen as they are the only pieces that attack horizontally.\nThis typical formation of 3 pawns is a common sight for either king. It is most common after castling because it provides safety. However, if you aren’t able to give your king an escape square, you can fall victim to backrank mates. } 2. Qb8# *\n\n\n"}, "1": {"Event": "Chess Trainer Hub - Checkmates: Staircase - Two Queens", "Site": "https://lichess.org/study/cRvEIzuY/eIHSLhiq", "Result": "*", "UTCDate": "2021.03.02", "UTCTime": "01:16:11", "Variant": "Standard", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "8/8/8/3k1K2/8/4Q3/5Q2/8 b - - 0 1", "SetUp": "1", "pgnContent": "\n1... Kc6 { To checkmate with two queens, the easiest method to learn is the Staircase Method. This is not the only way, and not the quickest, but is an easy way to master. This will help you learn the idea of how to checkmate.\nLet’s start with two queens as they are the easiest to use and protect each other along the way\nThe staircase method involves slowly pushing the king to the edge of the board, alternating which queen and queen.\nLet’s start with Qd2 and checkmate the king by alternating the queens along the second rank. } 2. Qfd2 Kb5 { The king has moved further to the back rank. Let's take away the third rank by alternating queens with Qc3. } 3. Qec3 Kb6 { The king stayed on the second rank so we should continue alternating our queens towards the a file. } 4. Qdb2+ Ka7 { To maintain the pattern to recognize, let's complete the checkmate with Qa3. Qa5 is also an option. } 5. Qca3# *\n\n\n"}, "2": {"Event": "Chess Trainer Hub - Checkmates: Staircase - Rook and Queen", "Site": "https://lichess.org/study/cRvEIzuY/FGYhiPm6", "Result": "*", "UTCDate": "2021.03.02", "UTCTime": "01:27:21", "Variant": "Standard", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "8/8/8/3k4/1R6/2Q5/3K4/8 b - - 0 1", "SetUp": "1", "pgnContent": "\n1... Kd6 { This checkmate is similar to two queens, except you will need your queen to be further away from the black king. This means you can complete the staircase mate without any thought as your queen will always protect the rook.\nWith the pieces flipped around, you won't be able to check with the queen as easily as the king can capture the queen if it is unprotected. } 2. Rd4+ Ke5 { We are now 4 files away from the north and east edges of the board.\nChoose to move towards whichever edge of the board you'd like. } 3. Qe3+ (3. Qc5+ Kf6 { We can now alternate our rook and queen along the c and d files until the king is at the edge of the board } 4. Rd6+ Ke7 5. Qc7+ Kf8 6. Rd8#) 3... Kf5 { We can now alternate our rook and queen along the 4th and 3rd ranks until the king is at the edge of the board } 4. Rf4+ Kg6 5. Qg3+ Kh7 6. Rh4# *\n\n\n"}, "3": {"Event": "Chess Trainer Hub - Checkmates: Staircase - Two Rooks", "Site": "https://lichess.org/study/cRvEIzuY/Hfl4BUha", "Result": "*", "UTCDate": "2021.03.02", "UTCTime": "01:34:19", "Variant": "Standard", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "8/8/3k4/1R6/R7/8/2K5/8 b - - 0 1", "SetUp": "1", "pgnContent": "\n1... Kc6 { Just like the 2 queen checkmate or the queen and rook, you want to alternate files, taking squares away.\nWith two rooks, you will need to “waste a move” or “mark time.\" This means spending a move with a rook and forcing the black king to move.\nSince rooks can control an entire file or rank from multiple squares, this is the ideal way to waste a move.\nBecause the king can capture one of the rooks if unprotected, it’s important to remember this.\nIf you accidentally allow the king to capture 1 rook, you will need to give checkmate with a rook and king alone, covered below.\nLet's move our b5 rook as far away from the king as possible, but still on the 4th rank. } 2. Rh5 Kb6 { With the king so close to our rook on the 4th, we cannot continue pushing the king to the edge of the board. To mark time, we should move our a4 rook as far away from the king as possible on the 4th rank, but diagonally next to the h5 rook.\nThis allows the rooks to alternate pushing the king to the edge of the board, without getting in each other's way. } 3. Rg4 { We can now push the king to the top edge of the board. } 3... Kc6 { Now begin alternating your rooks in the same fashion as the staircase method with the queens. } 4. Rg6+ Kd7 5. Rh7+ Ke8 6. Rg8# *\n\n\n"}, "4": {"Event": "Chess Trainer Hub - Checkmates: Queen and King vs King: The Box", "Site": "https://lichess.org/study/cRvEIzuY/2zjYO4jB", "Result": "*", "UTCDate": "2021.02.24", "UTCTime": "21:58:33", "Variant": "Standard", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "8/8/2k5/8/Q3K3/8/8/8 b - - 0 1", "SetUp": "1", "pgnContent": "\n1... Kd6 { The easiest way to learn how to checkmate with a queen and king is the Box method. This can be used for a rook endgame as well in a similar fashion.\nThe box method involves closing your opponent into a smaller and smaller imaginary box on the board.\nLet's begin with Qb5 to limit the king from moving away from our king. } 2. Qb5 Ke7 { Notice how the queen starts the king off in a box from a4-a8-h8-h4.\nMoving the queen to b5 makes the box smaller (b5-b8-h8-h5).\nThe king should move to e6 to avoid making the box smaller. Any other move will give a quicker mate as the queen will reduce the size of the box without moving the king.\nWith the king on e7 now, we can make the box smaller by moving to the third rank. } (2... Kc7 { Whenever the king moves backwards, continue to take away its chance to come forward. } 3. Qa6 Kd7 { We have two options now. Both allow us to move the king to the back rank in the subsequent move.\nLet's play Ke5. } 4. Ke5 (4. Kd5 Ke7 { We can force the king backwards with Qe6, however, there is a quicker way to deliver checkmate.\nLet's keep the king from moving any further away from the king and force him back.\nPlay Qg6. } 5. Qg6 Kd7 6. Qf7+ Kc8 7. Kc6 Kb8 (7... Kd8 8. Qd7#) 8. Qb7#) 4... Kc7 { The quickest way to checkmate is to force the king backwards. Find the key queen move that forces the king to move to the back rank. } 5. Qb5 Kd8 { With the box method, we want to keep the king from coming forward.\nLet's play Qb7 to keep the king on the back rank. } (5... Kc8 { We can now keep the king on the backrank with a king move. } 6. Kd6 Kd8 7. Qd7# (7. Qb8#)) 6. Qb7 Ke8 { Take the opposition. } 7. Ke6 Kf8 (7... Kd8 8. Qd7#) 8. Qf7#)  (2... Ke6 { We can now force the king back a rank and bring our queen closer.\nPlay Qc6. } 3. Qc6+ Kf7 { We want to grab the opposition if there is no way to force the king back further. } 4. Kf5 Ke7 { Force the king to the back rank. } 5. Qc7+ Kf8 { Take the opposition. } 6. Kf6 Kg8 (6... Ke8 7. Qe7#) 7. Qg7#) 3. Qc6 Kf7 { Now we need to bring our king closer. In this scenario, it's best done by taking the direct opposition.\nOpposition involves both kings being 1 square apart, essentially staring at each other daring them to step forward, but they can’t! } 4. Kf5 Ke7 { The king can now be forced to the edge of the board with either Qc7 or Qe6.\nLet's move to Qc7 to continue the box idea. } 5. Qc7+ Kf8 { We again want to take the direct opposition for the quickest checkmate. } 6. Kf6 Kg8 (6... Ke8 7. Qe7#) 7. Qg7# *\n\n\n"}, "5": {"Event": "Chess Trainer Hub - Checkmates: Rook and King vs King", "Site": "https://lichess.org/study/cRvEIzuY/bQro7Jhl", "Result": "*", "UTCDate": "2021.02.24", "UTCTime": "22:00:22", "Variant": "Standard", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "8/8/5k2/8/2R1K3/8/8/8 b - - 0 1", "SetUp": "1", "pgnContent": "\n1... Ke6 { Checkmating with a rook alone is not as easy as checkmating with a queen alone, but it employs the same Box methodology.\nThe best way is to slowly push your opponent back to the edge of the board again, but this time you’ll want to maintain opposition before pushing the opponent’s king.\nSince the kings are in opposition, we want to take the third rank away from the king and push him backwards. } 2. Rc6+ Ke7 { The rook pushed the king back with check, and the white king controls the squares it can move forward. You will want to continue to achieve this formation until the king is on the edge of the board.\nNow we want to grab the opposition. } 3. Ke5 Kd7 { When the king moves close to the rook, for the box method to be followed, it must move to the other side of the king, as far away as possible.\nHowever, in this scenario, we are able to force the black king into opposition by keeping the rook on the c file. We can move to c1, c2, c3, c4, or c5 safely without being captured.\nLet's move the rook to c2. } 4. Rc2 Ke7 { Continue forcing the king to the edge until checkmate is delivered. } 5. Rc7+ Kd8 { Let's take the opposition again to force the king to run to the corner. } 6. Kd6 Ke8 { If the defending king tries to get sneaky by going back and forth (this can sometimes trip up beginner players) then you’lll want to remember to skip a move where possible, as above.\nSkipping a move, or marking time, is a chess term that is used when you want to force your opponent into a bad position (zugswang).\nThis will reduce the number of moves you need to achieve checkmate.\nSince you can’t actually skip your turn, you can make a move on the board that seemingly wastes a move, but is really designed to put your opponent into a position they don’t want to be in and make a move they don’t want to make.\nWhite must “mark time” by moving the rook without allowing the king to attack it. Keeping the threat of checkmate if the black king moves into opposition at any time.\nLet's move the rook to a7, as far away as possible, just in case. } 7. Ra7 Kf8 { Follow the king } 8. Ke6 Kg8 { Follow the king } 9. Kf6 Kh8 { Follow the king } 10. Kg6 Kg8 { The king was forced to come back into opposition and now we can deliver checkmate.\nBe sure to remember that your rook won’t be able to protect itself as easily as a queen. Always make sure your rook is protected or has a nice amount of checking distance from the king. } 11. Ra8# *\n\n\n"}, "6": {"Event": "Chess Trainer Hub - Checkmates: Smothered Checkmate", "Site": "https://lichess.org/study/cRvEIzuY/ItpwoQM2", "Result": "*", "UTCDate": "2021.03.02", "UTCTime": "02:04:24", "Variant": "Standard", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "1r4k1/6pp/8/4N3/3Q4/8/3K4/8 b - - 0 1", "SetUp": "1", "pgnContent": "\n1... Rc8 { A smothered checkmate is when the king is stuck in a cramped space and checkmate is delivered by a knight.\nYou can often force this scenario when the c or f pawn has moved and the diagonal striking the king is open. } 2. Qd5+ Kh8 { Had the king moved to f8 right away, checkmate on f7.\nWe can now check the king and force him to move into xray vision of the queen. } 3. Nf7+ Kg8 { We now want to double check the king by moving the knight and creating a discovered check. Whenever double check occurs, the king must move. We already know the king cannot move to f8. } 4. Nh6+ Kh8 { In order to create a smothered checkmate, we need to force another piece to remove the escape square of the king. How can we force the rook to g8. } 5. Qg8+ Rxg8 { With the king trapped, we can deliver the checkmate. } 6. Nf7# *\n\n\n"}, "7": {"Event": "Chess Trainer Hub - Checkmates: Anastasia’s Checkmate", "Site": "https://lichess.org/study/cRvEIzuY/8DiYTz6v", "Result": "*", "UTCDate": "2021.03.02", "UTCTime": "02:11:38", "Variant": "Standard", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "5r2/kp1N4/8/8/8/8/6K1/1R6 b - - 0 1", "SetUp": "1", "pgnContent": "\n1... Rb8 { Anastasia’s checkmate involves a knight and rook, and usually the opponent’s own pawn, to create a checkmate.\nNote how the king cannot move to b6, b7, or b8, effectively forming a wall that is similar to a backrank checkmate. } 2. Ra1# *\n\n\n"}, "8": {"Event": "Chess Trainer Hub - Checkmates: Opera Checkmate", "Site": "https://lichess.org/study/cRvEIzuY/zNnZwupf", "Result": "*", "UTCDate": "2021.03.02", "UTCTime": "02:17:45", "Variant": "Standard", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "8/k1p4r/1pB5/8/8/8/5K2/3R4 b - - 0 1", "SetUp": "1", "pgnContent": "\n1... Rg7 { An Opera checkmate occurs with a bishop (or queen) and a rook. Like Anastasia’s Mate, the opponent’s pawn usually helps remove a square the king can move to.\nThis checkmate is most common when the bishop is able to occupy the squares a defensive fianchetto would. This means you want to watch out for this type of mate when you fianchetto your bishop and trade it away for a knight.\nBegin by checking the king. } 2. Ra1+ Kb8 { The bishop supports the rook's final checkmate from a distance. } 3. Ra8# *\n\n\n"}, "9": {"Event": "Chess Trainer Hub - Checkmates: Hook Mate", "Site": "https://lichess.org/study/cRvEIzuY/tndmYJcW", "Result": "*", "UTCDate": "2021.03.02", "UTCTime": "02:20:01", "Variant": "Standard", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "8/1kp4R/2N5/1P6/6r1/8/5K2/8 b - - 0 1", "SetUp": "1", "pgnContent": "\n1... Ka8 { The hook mate is a nice maneuver using the knight, pawn, and rook in unison.\nThe pattern involves the pawn protecting the knight and the rook checks the king. When the king moves closer to the knight, you can checkmate the king with the rook where it is protected by the knight.\nBegin by checking the king. } 2. Rh8+ Kb7 { The only escape square for the king is b6. We can check and remove this flight square at the same time. } 3. Rb8# *\n\n\n"}, "10": {"Event": "Chess Trainer Hub - Checkmates: David and Goliath mate with pawn", "Site": "https://lichess.org/study/cRvEIzuY/tHzypTwi", "Result": "*", "UTCDate": "2021.03.02", "UTCTime": "02:51:58", "Variant": "Standard", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "8/8/1k3R2/p1p5/1b4r1/PP1N4/5K2/8 b - - 0 1", "SetUp": "1", "pgnContent": "\n1... Kb5 { The David and Goliath checkmate occurs when a lowly pawn delivers the final checkmate blow. This often occurs when the king is on the run towards the enemies side of the board or in a rook endgame when the rook takes away an entire row of escape squares. } 2. a4# *\n\n\n"}, "11": {"Event": "Chess Trainer Hub - Checkmates: Cozio's Mate", "Site": "https://lichess.org/study/cRvEIzuY/FQ37WHru", "Result": "*", "UTCDate": "2021.03.02", "UTCTime": "02:58:35", "Variant": "Standard", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "3R4/1p1b4/p2k4/4Q3/1K6/4N3/PP4r1/8 b - - 0 1", "SetUp": "1", "pgnContent": "\n1... Kc6 { Cozio’s checkmate (or Dovetail checkmate) occurs when a queen delivers checkmate without its own pieces helping out, aside from the queen’s protection. The main culprits of this checkmate are the opponent’s own pieces, usually pawns.\nOur goal is to force the king towards its own pawns where it will have limited movement.\nLet's start with d5 to set up the checkmate (Qc5 would checkmate right away with the Swallow Tail mate). } 2. Qd5+ (2. Qc5# { This checkmate is another version of the dovetail mate called the swallowtail mate. It's the same idea except the angle of the checkmate is turned slightly. }) 2... Kb6 { Both pawns block the king's movement. The only escape square is a7. We need to deliver check in a way that removes this escape square. } 3. Qc5# *\n\n\n"}, "12": {"Event": "Chess Trainer Hub - Checkmates: Bishop - Mating with 2 bishops", "Site": "https://lichess.org/study/cRvEIzuY/nsfpqbR2", "Result": "*", "UTCDate": "2021.02.24", "UTCTime": "22:03:55", "Variant": "Standard", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "8/5k2/8/4K3/8/3B2B1/8/8 b - - 0 1", "SetUp": "1", "pgnContent": "\n1... Ke7 { Checkmating with two bishops is not as tricky as it seems. When the bishops work together, they take away two diagonals which can seem just as powerful as a single rook. This limits the squares a king can move forward.\nThere are multiple options here but let's try the quickest method. Start by bringing the bishop to f5. } 2. Bf5 Kd8 { How can we unleash our dark squared bishop, and still get our king in the best position where it should be in the top right corner? } (2... Ke8 3. Ke6 Kf8 { Our king wants to end up on g6 or h6, so as long as opposition allows, we should use this to help get our king to h6. } 4. Kf6 Ke8 { IF the king puts up the most resistance by running away, we want to not check him, but force him to the corner with our bishops, and then get our king to g6. } 5. Bc7 Kf8 { Now we can use the light squared bishop. } 6. Bd7 Kg8 7. Kg6 Kf8 8. Bd6+ Kg8 9. Be6+ Kh8 10. Be5#)  (2... Kf8 { Our king wants to be on g6 or h6. Whenever the king is on the edge of the board, you can grab the opposition and then force the king to the corner. } 3. Kf6 Ke8 { If the king puts up the most resistance by running away, we want to not check him, but force him to the corner with our bishops, and then get our king to g6. } 4. Bc7 Kf8 5. Bd7 Kg8 { Grab the opposition } 6. Kg6 Kf8 { Alternate bishop checks until you can mate your opponent } 7. Bd6+ Kg8 { Alternate bishop checks until you can mate your opponent } 8. Be6+ Kh8 { deliver checkmate } 9. Be5#) 3. Kf6 Ke8 { Let's now force the king to move to the corner with our dark squared bishop. } 4. Bc7 Kf8 { Now we can keep forcing the king with our light squared bishop. } 5. Bd7 Kg8 { Our king wants to control the g7 and h7 squares at once. } 6. Kg6 Kf8 { We can now take away all but two squares with the king using our dark squared bishop. } 7. Bd6+ Kg8 { And now we can force him to his last square. } 8. Be6+ Kh8 9. Be5# *\n\n\n"}, "13": {"Event": "Chess Trainer Hub - Checkmates: Knight and Bishop Mate - W Maneuver", "Site": "https://lichess.org/study/cRvEIzuY/mgL5cQYb", "Result": "*", "UTCDate": "2021.02.24", "UTCTime": "22:06:41", "Variant": "Standard", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "6k1/5N2/5K2/5B2/8/8/8/8 b - - 0 1", "SetUp": "1", "pgnContent": "\n1... Kf8 { In order to checkmate with a knight and bishop, one of the most common methods is the W Maneuver.\nWhile not the only way to achieve checkmate, it's the most instructive.\nThe king starts in the \"wrong corner\" because it's the opposite color as our bishop. We want to now force him to the correct corner on the top left of the board.\nBegin by taking away the g8 square so the king can't move back to the wrong corner. } { [%cal Gf7e5,Ge5d7,Gd7c5,Gc5b7] } 2. Bh7 Ke8 { We can now start our W maneuver, which involves the knight safely moving from f7 to e5, d7, c5, and then b7. } 3. Ne5 Kf8 { Continue the W maneuver. } (3... Kd8 { If the black king runs away, it can seem like it's going to escape, but white can force the king to the correct corner of the board. Let's chase him down with our king. } 4. Ke6 Kc7 { Now we continue with the W. This removes key escape squares for the king. } 5. Nd7 Kc6 { The king seemingly gets out, but the bishop is in time to create a wall with the knight. } 6. Bd3 Kc7 7. Be4 { Let's tighten the grip again and force the king back into the W maneuver. } 7... Kc8 { Our king should continue towards the corner. } 8. Kd6 Kd8 { Let's force the king towards the right corner. } 9. Bg6 Kc8 { Continue the W maneuver } 10. Nc5 Kd8 11. Nb7+ Kc8 12. Kc6 Kb8 { Let's move our king to its final position on b6. } 13. Kb6 Kc8 14. Bf5+ Kb8 { Now the white knight has to relocate to deliver check on the b8 square without obstructing the bishop. We want to maneuver to a6. } 15. Nc5 Ka8 16. Be6 Kb8 17. Na6+ { Now we check with our knight without blocking our bishop. } 17... Ka8 18. Bd5#) 4. Nd7+ { If the king moves back towards the wrong corner, the W method becomes easier. White just plays a few moves to remake the W, but 2 files to the left. } 4... Ke8 { Take the opposition. } 5. Ke6 Kd8 { Take the opposition. } 6. Kd6 Ke8 { Now using your bishop, force the king further towards the right corner. } 7. Bg6+ Kd8 { Now continue the W maneuver. } 8. Nc5 Kc8 { The king cannot move away from the back rank. Let's waste a move with our bishop. Either f7 or h5 will work here. Let's play Bf7. } 9. Bf7 Kd8 { The king is again the most combative, but we can complete the W maneuver. } 10. Nb7+ Kc8 11. Kc6 Kb8 { Now let's take the opposition and then force the king to the corner with our minor pieces. } 12. Kb6 Kc8 13. Be6+ Kb8 { Now the white knight has to relocate to deliver check on the b8 square without obstructing the bishop. We want to maneuver to a6. } 14. Nc5 Ka8 { A tempo move with the bishop is needed. A knight can never lose a tempo and the king is in the perfect position so a waiting move with the bishop is necessary.\nLet's play Bf5. } 15. Bf5 Kb8 { Now we check with our knight without blocking our bishop. } 16. Na6+ Ka8 17. Be4# *\n\n\n"}, "14": {"Event": "Chess Trainer Hub - Checkmates: Knight and Bishop Mate - Getting to the W and setting it up", "Site": "https://lichess.org/study/cRvEIzuY/uv9pdOjp", "Result": "*", "UTCDate": "2021.02.24", "UTCTime": "22:12:53", "Variant": "Standard", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "8/4k3/8/8/8/8/8/3NKB2 b - - 0 1", "SetUp": "1", "pgnContent": "\n1... Ke6 { We first want to start by bringing our king out as far as it can go. Let's start with Ke2. } 2. Ke2 Ke5 { Let's zigzag by playing d3 } 3. Kd3 Kf6 { Get as close as possible to the enemy king. } 4. Ke4 Ke6 { Now with the kings in opposition, we can bring our minor pieces into play. Check the king with the bishop on c4. } 5. Bc4+ Kf6 { Centralize the knight. } 6. Ne3 Ke7 { The king is now on the second rank. Let's get our king closer. } 7. Ke5 Kd7 { Limit the king from coming back to the third rank. } 8. Bd5 { Now the king has moved to the first rank. } 8... Ke7 { Our knight wants to end up on f7. Let's bring it to c4 so it can achieve that in two moves. } 9. Nc4 Kf8 { Take the opposition. } 10. Kf6 Ke8 { These next few moves will be for illustrative purposes to get the king to the wrong corner so that we can begin the W Maneuver. They are not forced moves by your opponent.\nThe knight should move to e5 to be able to get to f7. } 11. Ne5 Kf8 { Push the king to the wrong corner first to initiate the W maneuver. } 12. Bc6 Kg8 { Our knight wants to be on f7. } 13. Nf7 Kf8 { We need to waste a move. Let's move our bishop to b5. } 14. Bb5 Kg8 { Move the bishop to d3. } 15. Bd3 Kf8 { We have now achieved the previous diagram.\nWe could have pushed the king to the correct corner, but this will better illustrate the W maneuver. } *"}}}