{"lucena_philidor_and_vancura": {"0": {"Event": "Hub - Lucena, Philidor, and Vancura: What is the Lucena", "Site": "https://lichess.org/study/Yvo5PG8E/nrfaSkyJ", "Result": "*", "UTCDate": "2020.12.04", "UTCTime": "21:01:10", "Variant": "Standard", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "3K4/3P2k1/8/8/8/8/2r5/5R2 w - - 0 1", "SetUp": "1", "pgnContent": "\n1. Ke7 { The Lucena position, sometimes called building a bridge, is absolutely a must know rook ending that starts from the following position. The king starts in front of the pawn and needs to find a way to move out of the way, shielded from checks, so the pawn can promote.\nIf the white king ever comes out along the e file, the black rook will check the king over and over until it goes back in front of the pawn.\nContinue checking the king and notice how the king cannot make progress. The king can never move too far from the pawn because it is the only piece protecting it. } 1... Re2+ 2. Kd6 { Keep checking the king } 2... Rd2+ 3. Ke6 { Keep checking the king } 3... Re2+ 4. Kd6 { Keep checking the king } 4... Rd2+ 5. Ke7 { Keep checking the king } 5... Re2+ 6. Kd8 { Since the king cannot move away from the pawn, this means that in order for white to win the first move must be a rook move.\nTo see where the rook goes, let's think about the King's goals.\n- The king needs to get away from the queening square\n- The king needs to find shelter with help from the rook } *\n\n\n"}, "1": {"Event": "Hub - Lucena, Philidor, and Vancura: Building a Bridge", "Site": "https://lichess.org/study/Yvo5PG8E/UxMwvlhm", "Result": "*", "UTCDate": "2021.05.06", "UTCTime": "03:31:43", "Variant": "Standard", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "3K4/3P2k1/8/8/8/8/2r5/5R2 b - - 0 1", "SetUp": "1", "pgnContent": "\n1... Rc3 { The Lucena occurs in this situation where white has checked the king and forced it away. This gets the tempo we need to get our king out.\nHowever as we saw, the king cannot come out yet because it has no shelter. The key to the Lucena is the process of \"building a bridge.\"\nThis means that when your king gets to d5, it needs to be able to block any further checks with the rook. Find the best square to accomplish this. } { [%cal Gd8e7,Ge7d6,Gd6e6,Ge6d5] } 2. Rf4 Kg6 { Now we can zig zag out king out. The rook will be able to block the rook check and create a barrier between the king and pawn. } 3. Ke7 Re3+ 4. Kd6 Rd3+ 5. Ke6 Re3+ 6. Kd5 Rd3+ { Now we can block the check and black is unable to stop the pawn. } 7. Rd4 Rxd4+ 8. Kxd4 Kf7 9. d8=Q *\n\n\n"}, "2": {"Event": "Hub - Lucena, Philidor, and Vancura: B file practice", "Site": "https://lichess.org/study/Yvo5PG8E/UOVVe87E", "Result": "*", "UTCDate": "2021.05.06", "UTCTime": "04:47:01", "Variant": "Standard", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "1K6/1P2k3/8/8/8/8/2r5/1R6 b - - 0 1", "SetUp": "1", "pgnContent": "\n1... Kd7 2. Rd1+ Ke6 3. Rd4 Rb2 4. Kc7 Rc2+ 5. Kb6 Rb2+ 6. Kc6 Rc2+ 7. Kb5 Rb2+ 8. Rb4 Rxb4+ 9. Kxb4 *\n\n\n"}, "3": {"Event": "Hub - Lucena, Philidor, and Vancura: c file practice", "Site": "https://lichess.org/study/Yvo5PG8E/ygNMP6zi", "Result": "*", "UTCDate": "2021.05.06", "UTCTime": "04:49:30", "Variant": "Standard", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "2K2k2/2P5/8/8/8/8/1r6/R7 b - - 0 1", "SetUp": "1", "pgnContent": "\n1... Ke7 2. Re1+ Kd6 { Remember the concept of creating shelter. } 3. Kd8 Rc2 4. c8=Q Rxc8+ 5. Kxc8 *\n\n\n"}, "4": {"Event": "Hub - Lucena, Philidor, and Vancura: d file practice", "Site": "https://lichess.org/study/Yvo5PG8E/lnVbGax7", "Result": "*", "UTCDate": "2021.05.06", "UTCTime": "04:50:18", "Variant": "Standard", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "3K4/3P2k1/8/8/8/8/2r5/3R4 b - - 0 1", "SetUp": "1", "pgnContent": "\n1... Kf7 2. Rf1+ Kg6 3. Rf4 Rd2 4. Ke7 Rd1 { Remember to understand that the Lucena is a pattern, but your opponent might not adhere to the exact moves. Always watch for opportunities to end the game more quickly and avoid premoving in this scenario. } 5. d8=Q Rxd8 6. Kxd8 *\n\n\n"}, "5": {"Event": "Hub - Lucena, Philidor, and Vancura: Rook Pawns", "Site": "https://lichess.org/study/Yvo5PG8E/gq27u0AX", "Result": "*", "UTCDate": "2021.05.06", "UTCTime": "03:48:46", "Variant": "Standard", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "K7/P3k3/8/8/8/8/r7/6R1 b - - 0 1", "SetUp": "1", "pgnContent": "\n1... Kd7 { Rook pawns are much tougher to win with the Lucena technique. Though there are some tricks to it.\nIn many cases, you'll need to cut off the king by 5 files to win. In this exact scenario, this isn't needed because of the placement of the rook. We can create a skewer if the rook ever captures the a pawn.\nFor this reason, our king doesn't need to stay close to the pawn and can begin running away. } { [%cal Gg1g7,Gg7a7] } 2. Kb7 Rb2+ { Make sure to defend the pawn and make progress. } 3. Ka6 Ra2+ { Defend the pawn and make progress. } 4. Kb6 Rb2+ { We can now make a break for it since the pawn is safe thanks to a skewer by the rook. } 5. Kc5 Ra2 { Protect the advancement of the a pawn. } 6. Rg8 Rxa7 { Skewer the rook } 7. Rg7+ Ke6 8. Rxa7 *\n\n\n"}, "6": {"Event": "Hub - Lucena, Philidor, and Vancura: rook pawn with the king cut off by 5 files", "Site": "https://lichess.org/study/Yvo5PG8E/B18D47Ch", "Result": "*", "UTCDate": "2021.05.06", "UTCTime": "04:52:41", "Variant": "Standard", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "K7/P5k1/8/8/8/8/r7/4R3 b - - 0 1", "SetUp": "1", "pgnContent": "\n1... Kf7 { With the king far away, you are able to remove the possibilities of rook checks. You can now create shelter. } { [%cal Ge1b1,Gb1b6] } 2. Rb1 Ke7 3. Kb8 Kd6 4. a8=Q Rxa8+ 5. Kxa8 *\n\n\n"}, "7": {"Event": "Hub - Lucena, Philidor, and Vancura: Rook pawn exceptions", "Site": "https://lichess.org/study/Yvo5PG8E/p3RORPAq", "Result": "*", "UTCDate": "2021.05.06", "UTCTime": "04:55:25", "Variant": "Standard", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "7K/4k2P/8/8/8/8/7r/6R1 b - - 0 1", "SetUp": "1", "pgnContent": "\n1... Kf7 { This position is a draw because the king is too close to the pawn for white to make any progress. However that doesn't mean you shouldn't play on to see if your opponent knows the right moves. } 2. Rf1+ Kg6 { The correct move for black is to move away and white cannot make progress with the king so close. In this case however, we can utilize checks to win the rook or queen our pawn. Note that we now have shelter from rook checks thanks to the kings last move. } 3. Kg8 Rxh7 { We can now kick the king away from the rook's protection, or force it to the h file where we can skewer the king to the rook. } { [%cal Gf1g1,Gg1g6] } 4. Rg1+ Kh6 5. Rh1+ { [%cal Gh1h7] } 5... Kg6 6. Rxh7 *\n\n\n"}, "8": {"Event": "Hub - Lucena, Philidor, and Vancura: The Umbrella", "Site": "https://lichess.org/study/Yvo5PG8E/1NLfEKCy", "Result": "*", "UTCDate": "2021.05.06", "UTCTime": "04:04:41", "Variant": "Standard", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "8/8/8/R4p2/1r2k3/4p1P1/8/4K3 w - - 0 1", "SetUp": "1", "pgnContent": "\n1. Ke2 { The umbrella is Dvoretsky's term for having shelter from checks. Sometimes it's better to leave your opponent's material on the board so you can create shelter. This one involves a pawn sacrifice. } 1... f4 2. gxf4 { Now we want to move into f3 without capturing the f pawn. That way the white rook becomes useless. } 2... Rb2+ 3. Kf1 { Don't worry about material by capturing the pawn. We need it for shelter. } 3... Kf3 4. Ra1 { Check the king to force him to the corner. From here black can promote the pawn and shortly win the game. } 4... Rf2+ *\n\n\n"}, "9": {"Event": "Hub - Lucena, Philidor, and Vancura: Rook pawn - Keep your king on the edge", "Site": "https://lichess.org/study/Yvo5PG8E/cgH5FYZE", "Result": "*", "UTCDate": "2021.05.06", "UTCTime": "05:12:46", "Variant": "Standard", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "R7/P5k1/8/8/8/8/r7/7K b - - 0 1", "SetUp": "1", "pgnContent": "\n1... Kh7 { It's worth taking a moment to swap the rooks and put our rook in front of the pawn. White would love to move out of the way with check and then queen the pawn.\nThe issue is the black king can stay on the 7th and always stop the rook from following the plan.\nHowever, black can only do so from g7 and h7 in this situation.\nStart making progress towards the black rook } { [%cal Gh1b1,Gb1b6] } 2. Kg1 Kg7 { [%cal Gg1b1] } 3. Kf1 Kh7 4. Ke1 Kg7 5. Kd1 Kf7 { Black has blundered and moved away from g7 and h7. Why is this a blunder? } 6. Rh8 Rxa7 { We can now skewer the king to the rook. } 7. Rh7+ { [%cal Gh7a7] } 7... Ke6 8. Rxa7 *\n\n\n"}, "10": {"Event": "Hub - Lucena, Philidor, and Vancura: The Vancura Position", "Site": "https://lichess.org/study/Yvo5PG8E/5Xscv3gE", "Result": "*", "UTCDate": "2021.05.06", "UTCTime": "05:27:38", "Variant": "Standard", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "R7/6k1/P4r2/8/3K4/8/8/8 w - - 0 1", "SetUp": "1", "pgnContent": "\n1. Ke5 { The vancura position occurs when the white rook is passively in front of the rook pawn and the pawn has not yet reached the 7th rank.\nYou'll want to keep your rook on the 6th rank until the pawn moves forward. Let's move to b6. } 1... Rb6 2. Kd5 { You'll want to keep your rook on the 6th rank until the pawn moves forward } 2... Rf6 3. Kc5 { Now we need to keep checking the king. Remember it doesn't have shelter. It will try to run in front of the pawn and block checks from the side with the rook if possible. } 3... Rf5+ 4. Kb6 { Now we need to keep checking the king. } 4... Rf6+ 5. Ka7 { We can keep checking the king since there is no time for a pawn or rook to get in front of the king for shelter. } { [%csl Gb8,Gb6,Gb7] } 5... Rf7+ 6. Kb8 { Now we need to keep checking the king. } 6... Rf8+ 7. Kb7 { Now we need to keep checking the king. } 7... Rf7+ 8. Kb6 { Now we need to keep checking the king. } 8... Rf6+ 9. Ka5 { Now we need to keep checking the king. } 9... Rf5+ 10. Kb4 { Now we need to keep checking the king. } 10... Rf4+ 11. Kc3 { At some point, we need to go back to the 6th file. } 11... Rf6 12. a7 { Simply slide behind the passed pawn. } 12... Ra6 13. Kc2 { We have now reached the same position as the previous scenario. Keep your king on g7 and h7 and the game will be drawn } *\n\n\n"}, "11": {"Event": "Hub - Lucena, Philidor, and Vancura: Philidor", "Site": "https://lichess.org/study/Yvo5PG8E/8dF9mmph", "Result": "*", "UTCDate": "2020.12.04", "UTCTime": "21:28:35", "Variant": "Standard", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "4k3/R7/7r/3K4/4P3/8/8/8 w - - 0 1", "SetUp": "1", "pgnContent": "\n1. e5 { This position is known as the Philidor. The main point here is that you want to get your rook to the third or sixth rank and wait.\nSometimes waiting can be the hardest thing to do in an endgame, but it is often essential to winning or drawing.\nWaiting means not trying to make progress, and waiting for your opponent to make a move that makes their position worse. If they don't, the game can be drawn. In the case of the Philidor, both sides will wait eternally and it will be a draw.\nSo how do you wait? You move your rook back and forth along the third or sixth rank. In this scenario, your opponent should do the same.\nIf the player with the extra pawn ever gets tired of waiting and tries to advance the pawn, the key to a draw is to move the rook to the first rank and check from behind.\nBecause the pawn will have advanced too far, the king can no longer get shelter.\nLet's move to g6. } 1... Rg6 2. Rb7 { mark time by moving back and forth between g6 and h6 to see no progress can be made. } 2... Rh6 3. Ra7 { mark time by moving back and forth between g6 and h6 to see no progress can be made. } 3... Rg6 4. Rb7 { mark time by moving back and forth between g6 and h6 to see no progress can be made. } 4... Rh6 5. e6 { Now that white has grown impatient and moved the pawn forward, we can now check from behind. Let's move the rook as far away as it can go. } 5... Rh1 6. Kd6 { Check from behind. } 6... Rd1+ 7. Ke5 { Check from behind. } 7... Re1+ 8. Kf6 { Check from behind. } 8... Rf1+ 9. Ke5 { So in the Philidor Position you should always keep these things in mind:\n- It is a draw because the rook keeps checking from behind and there is nowhere to hide.\n- The white king needs shelter in order to advance the pawn.\n- Black bides his time until the pawn is pushed too far and then black retreats the rook to the e file } *\n\n\n"}, "12": {"Event": "Hub - Lucena, Philidor, and Vancura: How to win the Philidor", "Site": "https://lichess.org/study/Yvo5PG8E/fQLHns05", "Result": "*", "UTCDate": "2021.05.06", "UTCTime": "05:32:49", "Variant": "Standard", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "4k3/R7/7r/3KP3/8/8/8/8 b - - 0 1", "SetUp": "1", "pgnContent": "\n1... Rh1 { If your opponent doesn't know the philidor, they may blunder into this position. While still not a win for white, you do need to know the technique.\nWhite is able to force black to make a choice in the path to take. By playing Kd6, black can no longer check from the side on h6 because white will play e6 and win the game. } 2. Kd6 Rd1+ { Black has blundered and lost the game. Now our goal is to turn this lost philidor into a won lucena. } 3. Ke6 Kf8 { We can now start to force the king off the back rank and make progress with our pawn } 4. Ra8+ Kg7 5. Ke7 Re1 6. e6 Re2 { Let's swing our rook to the 4th to begin the bridge. We still need to get our pawn to the 7th rank with the king in front first. } 7. Ra4 Re3 { Check the king } 8. Rg4+ Kh6 { Let's move the king to f7. d7 also works. } 9. Kf7 Rf3+ { We can now move back in front of our pawn but we can move it to the 7th now. } 10. Ke8 Kh5 { Protect your rook first. Let's block potential checks from the side with Rd4. } 11. Rd4 Kg6 12. e7 { We have now reached the lucena and we can build a bridge and win the game. } *\n\n\n"}, "13": {"Event": "Hub - Lucena, Philidor, and Vancura: How to draw the philidor when you mess up", "Site": "https://lichess.org/study/Yvo5PG8E/pebs5mvq", "Result": "*", "UTCDate": "2021.05.06", "UTCTime": "05:40:16", "Variant": "Standard", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "3k4/6R1/8/3PK3/8/8/8/r7 w - - 0 1", "SetUp": "1", "pgnContent": "\n1. Ke6 { In the last position, we checked the king and he was able to win the game by moving in front of the pawn.\nThe key here is that even if you forget the Philidor and move away from the 6th rank, you can still draw by moving directly behind the pawn.\nIf you can stop white from kicking your king out from the back rank and progressing the pawn to the 7th, you can draw. You do this by stopping the pawn from moving forward from behind, or checking the king to keep him in front of the pawn. } 1... Rd1 2. Kd6 { The second key part of this is to go to the short side of the board. This means whichever side has less squares (there are 3 files to the left of the d pawn and 4 to the right). } 2... Kc8 3. Rg8+ Kb7 4. Rh8 { White can only wait. Moving the king up to d7 means dropping the pawn. Now we wait along the d file. Let's move to d2. } 4... Rd2 5. Ke6 { Continue controlling the d pawn from coming forward with the king. } 5... Kc7 { [%csl Gd6] } 6. Rh7+ { We can now reset the position and stay in front of the pawn. If the king takes the opposition, we go to the short side. } 6... Kd8 7. Kd6 { White is unable to make progress. We now go to the short side again. } 7... Kc8 *"}}}