{"rook_vs_two_pawns": {"0": {"Event": "Hub - Rook against 2 pawns: Pawns on the 7th", "Site": "https://lichess.org/study/dCnyOQwc/NDGmrsPx", "Result": "*", "UTCDate": "2021.05.21", "UTCTime": "18:35:25", "Variant": "Standard", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "8/8/2k5/8/2K5/8/5pp1/4R3 w - - 0 1", "SetUp": "1", "pgnContent": "\n1. Re2 { With two pawns on the 7th, the rook cannot stop them alone. Even two pawns on the 6th cannot easily be stopped.\nWe'll be looking at many situations of a rook vs 2 pawns to see what drawing techniques there are, and what patterns to look out for.\nPlay f1=Q to continue on and learn this ending } 1... f1=Q *\n\n\n"}, "1": {"Event": "Hub - Rook against 2 pawns: Pawns on the 7th - Study by Moravec", "Site": "https://lichess.org/study/dCnyOQwc/Te2P9ECi", "Result": "*", "UTCDate": "2021.05.21", "UTCTime": "19:11:20", "Variant": "Standard", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "6r1/P7/1P6/8/8/5k2/8/7K w - - 0 1", "SetUp": "1", "pgnContent": "\n1. b7 { This is a study by Moravec that shows you that a win is not always guaranteed if two pawns make it to the 7th rank against a rook.\nThe idea of checkmate and perpetual checks can help keep the pawns at bay.\nBegin by checking the king. } 1... Rh8+ 2. Kg1 { The king will start a journey all the way around the edge of the board. The black king should never step onto the B file or the b pawn will promote with check and white will win. } 2... Rg8+ 3. Kf1 { Now we have the threat of mate looming with our kings in opposition. There is only one move to keep the draw. } 3... Rh8 4. Ke1 { Begin chasing the king to keep the mate threat, but do not move the king on to the b file. } 4... Ke3 5. Kd1 { Begin chasing the king to keep the mate threat, but do not move the king on to the b file. } 5... Kd3 6. Kc1 { Begin chasing the king to keep the mate threat, but do not move the king on to the b file. } 6... Kc3 7. Kb1 { Now if we flip the board 90 degrees, we would see the same position as the starting position. We must check from the first rank. } 7... Rh1+ 8. Ka2 Rh2+ 9. Ka3 { Create a mate threat. } 9... Rh1 10. Ka4 { Maintain the opposition } 10... Kc4 11. Ka5 { Maintain the opposition } 11... Kc5 12. Ka4 { The king could not go to a6 or it would have been checkmate. We continue to chase the king so no progress can be made. } 12... Kc4 13. Ka3 { Maintain the opposition } 13... Kc3 14. Ka2 { Now we need to check with the rook since there isn't a mate threat with the opposition. } 14... Rh2+ *\n\n\n"}, "2": {"Event": "Hub - Rook against 2 pawns: One pawn on 7th - Rook on queening rank", "Site": "https://lichess.org/study/dCnyOQwc/K7yNglFr", "Result": "*", "UTCDate": "2021.05.21", "UTCTime": "18:36:45", "Variant": "Standard", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "8/8/8/8/8/2kp4/4pK2/7R b - - 0 1", "SetUp": "1", "pgnContent": "\n1... Kd2 { This is the basic position white should strive for. The king is optimally placed and just needs to gain time for the king to vacate the d2 square for his king to enter. Whites forces are well coordinated.\nOur goal is to stay on the first rank with our rook and force the king away from d2.\nLet's play rg1. (ra1, rb1, and re1 also win). } 2. Rg1 Kc3 { Now that the king has moved from d2, we can occupy the key square of e3 with our king. } 3. Ke3 Kc2 { Now the rook just needs to waste a move. Best is Re1 so that if the d pawn moves, we can capture the e pawn and pin the d pawn to the king. } 4. Re1 Kc3 { Take advantage of the opposition to gain more space. } 5. Rc1+ Kb2 { Now we can occupy the critical square of d2 with our king, thus stopping the pawns from moving forward at all. } 6. Kd2 Ka3 7. Kxd3 Kb4 8. Kxe2 *\n\n\n"}, "3": {"Event": "Hub - Rook against 2 pawns: One pawn on 7th -  Rook behind pawns", "Site": "https://lichess.org/study/dCnyOQwc/G9jYltir", "Result": "*", "UTCDate": "2021.05.21", "UTCTime": "18:45:43", "Variant": "Standard", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "4R3/8/8/8/8/2kp4/4pK2/8 b - - 0 1", "SetUp": "1", "pgnContent": "\n1... Kd2 { In most scenarios, the key is not to win the game, but how to not lose by allowing your opponent to queen.\nIn this scenario, the rook must stay behind the most advanced pawn in order to prevent the pawn from queening.\nLet's start with Re7. } 2. Re7 Kd1 { We need to keep waiting along the e file. The easiest is Re8 since it increases the chance of a three move repetition. } 3. Re8 d2 { The king needs to control d2 to prevent the white king from making it to e1.\nHowever, white is able to just wait with the rook so eventually black must try something else and can play d2.\nWhen this happens, the king is in front of the pawn so we can safely capture one of the two pawns.\nWhat black was attempting is known as switching the leading pawn. Our goal as the side with the rook is to keep the rook behind the leading pawn. The side with the pawns' goal is to switch the leading pawn in a way that the rook becomes misplaced. } 4. Rxe2 Kc1 { The pawn is too far forward and now the rook must be sacrificed for the draw. } 5. Rxd2 Kxd2 *\n\n\n\n"}, "4": {"Event": "Hub - Rook against 2 pawns: One pawn on 7th - You have the pawns - The ideal position", "Site": "https://lichess.org/study/dCnyOQwc/C1Vqu33Q", "Result": "*", "UTCDate": "2021.05.23", "UTCTime": "15:35:12", "Variant": "Standard", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "8/8/8/8/8/1p6/1kpK4/7R w - - 0 1", "SetUp": "1", "pgnContent": "\n1. Rg1 { Our king wants to be on a2 to create a possible stalemate.\nThis is the ideal scenario to think about when you have the pawns.\nThe goal is to trap our own king in the corner when the rook captures b2. } 1... Ka2 2. Kc3 { We now want to promote our pawn since it will force our own king to the corner and stalemate. } 2... c1=Q+ 3. Rxc1 b2 4. Rc2 { With our king in the corner, the pawn is immune, but must be captured at the same time. } 4... Ka1 5. Rxb2 *\n\n\n"}, "5": {"Event": "Hub - Rook against 2 pawns: One pawn on 7th - You have the pawns - Another technique", "Site": "https://lichess.org/study/dCnyOQwc/Ih4uOXkI", "Result": "*", "UTCDate": "2021.05.23", "UTCTime": "14:39:43", "Variant": "Standard", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "8/8/8/8/8/1p6/1kpK4/5R2 w - - 0 1", "SetUp": "1", "pgnContent": "\n1. Rc1 { Here's another scenario where you have the pawns and are attempting to draw. Let's play Ka3. (ka2 also works) } 1... Ka3 2. Kc3 { White is threatening mate and we must push our b pawn. } 2... b2 3. Kxc2 { Since our king wasn't on a2, taking with the rook would have allowed black to queen the pawn. } 3... bxc1=Q+ 4. Kxc1 *\n\n\n"}, "6": {"Event": "Hub - Rook against 2 pawns: One pawn on 7th -  a and b Pawns", "Site": "https://lichess.org/study/dCnyOQwc/akH9kgEc", "Result": "*", "UTCDate": "2021.05.21", "UTCTime": "18:54:56", "Variant": "Standard", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "8/8/8/8/p7/8/kp1K4/5R2 b - - 0 1", "SetUp": "1", "pgnContent": "\n1... a3 { Let's see another stalemate idea. Find the only move to draw. } 2. Kc2 b1=Q+ { Black was forced to queen and we're forced to capture, leading to an immediate staltemate. } 3. Rxb1 *\n\n\n"}, "7": {"Event": "Hub - Rook against 2 pawns: One pawn on 7th -  Where to put your rook if the king is out of position", "Site": "https://lichess.org/study/dCnyOQwc/WkjS7zU4", "Result": "*", "UTCDate": "2021.05.21", "UTCTime": "19:06:14", "Variant": "Standard", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "2R5/8/8/6K1/8/2pp1k2/8/8 b - - 0 1", "SetUp": "1", "pgnContent": "\n1... c2 { Right now, our rook is optimally placed behind the leading pawn.\nOur king is out of position and we need to bring it closer. The opposition is a good thing to keep in mind when bringing our king closer. } 2. Kf5 Kg3 { Sometimes your opponent can trip you up and not play an obvious move, like moving towards the pawns and helping them promote. (this would still be a draw).\nOur goal is to stop both pawns at the same time. } 3. Rc3 Kf2 { With the d pawn pinned to the king, the king must now move to the second rank, which allows our king to move closer and attack the backwards pawn. } 4. Ke4 Ke2 { There are now multiple ways to draw with our king now in position. Let's choose Rd5 since the king must now leave the pawn or push a pawn forward. } 5. Kd4 d2 { We can now capture a pawn before black can swap the leading pawns. } 6. Rxc2 Ke1 7. Rxd2 *\n\n\n"}, "8": {"Event": "Hub - Rook against 2 pawns: One pawn on 7th -  Getting your King into Position", "Site": "https://lichess.org/study/dCnyOQwc/hXPEOWMB", "Result": "*", "UTCDate": "2021.05.21", "UTCTime": "18:57:27", "Variant": "Standard", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "1R6/8/8/8/3K4/p7/1p2k3/8 b - - 0 1", "SetUp": "1", "pgnContent": "\n1... Kd2 { We're always striving to get our king into a better position closer to the pawn. In this instance we're unable to, but we can utilize our rook to stop both pawns at the same time.\nAgain, this works now because the king is on the second rank which would allow check if the a pawn moved forward. If we try to get our king closer to the pawns now, we will not be able to draw. } 2. Rb3 Kc2 { We're still unable to move our king closer since black is threatening to queen the pawn.\nOur king is optimially placed however to assist in checks from the third rank. } 3. Rc3+ Kd1 { If black went in front of the pawn then white would capture the a pawn and it would turn into a rook vs knight pawn on the 7th, which we've seen in previous courses is a draw with the king placed on c1.\nWe need to continue checking so the king either steps in front of the pawn, or moves far away and we can move back to b3. } 4. Rd3+ Ke1 { Continue checking. } 5. Re3+ Kf2 { With the king far enough away, we can move back to b3 and prevent the queen from materializing. Now our king is finally able to move in and help support capturing both pawns. } 6. Rb3 Ke1 7. Kc3 Kd1 8. Rxb2 axb2 9. Kxb2 *\n\n\n"}, "9": {"Event": "Hub - Rook against 2 pawns: One Pawn on 7th - Creating mating threats", "Site": "https://lichess.org/study/dCnyOQwc/wOUKYGwc", "Result": "*", "UTCDate": "2021.05.21", "UTCTime": "19:08:17", "Variant": "Standard", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "8/8/8/8/4K1k1/pp6/8/5R2 b - - 0 1", "SetUp": "1", "pgnContent": "\n1... b2 { Sometimes our king is so far out of position that the only way to not lose is to threaten checkmate. We saw this idea in the Moravec study at the beginning of this course. } 2. Rg1+ Kh5 { Threaten checkmate. } 3. Kf5 Kh4 { Threaten checkmate. } 4. Kf4 Kh3 { Threaten checkmate. } 5. Kf3 Kh2 { Black has blundered and lost the game. He needed to keep moving along the h file and take the draw. Let's see how we can win the game now.\nWe need to prevent both pawns from getting to the 7th, but force black in to zugzwang. } 6. Rb1 a2 { Note that the king cannot move to h3 or it's mate in one. He is now forced to lose both pawns thanks to check. } 7. Rxb2+ Kh3 8. Rxa2 *\n\n\n"}, "10": {"Event": "Hub - Rook against 2 pawns: Pawns on the 6th -  Create mating threats", "Site": "https://lichess.org/study/dCnyOQwc/SNH9msav", "Result": "*", "UTCDate": "2021.05.21", "UTCTime": "19:09:37", "Variant": "Standard", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "2R5/8/8/3K4/1k4p1/5p2/8/8 b - - 0 1", "SetUp": "1", "pgnContent": "\n1... g3 { With the pawns on the 6th rank, we're able to still create mating threats to try to win the game, or at least get our pieces into a better position. Control the 4th rank with your rook and check the king. } 2. Rc4+ Kb3 { We now want to go behind the leading pawn. Since no leading pawn exists yet, we can force one to become the leading pawn. } 3. Rf4 f2 { The pawns are not yet frozen. We must maneuver our king to try to create a mate threat as we saw in the earlier study by Moravec. } 4. Kc5 g2 { The pawns have now reached the 7th and our king is optimally placed. The black king cannot move to the second rank because we capture a pawn with check. } 5. Rf3+ Ka4 { We now have our study from Moravec achieved. Continue creating mate threats. } 6. Rf4+ Ka5 { Create another mate threat. } 7. Rf3 Ka6 { Maintain the opposition } 8. Kc6 Ka7 { Check the king while staying behind the pawn. } 9. Rf7+ Kb8 { Check the king. } 10. Rf8+ Ka7 { Check the king. } 11. Rf7+ Ka6 { We're now able to win the game due to black's blunder!\nCreate a mate threat and attack both pawns. } 12. Rxf2 Ka5 13. Rxg2 *\n\n\n"}, "11": {"Event": "Hub - Rook against 2 pawns: Pawns on the 6th", "Site": "https://lichess.org/study/dCnyOQwc/ArNxsDJl", "Result": "*", "UTCDate": "2021.05.21", "UTCTime": "18:59:02", "Variant": "Standard", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "8/8/8/8/1kp5/1p6/8/1KR5 b - - 0 1", "SetUp": "1", "pgnContent": "\n1... c3 { We just saw a brief example of both pawns on the 6th and how we can utilize mate threats to draw or possibly win if your opponent goes awry.\nYou often hear that with two pawns on the 6th, black can win or at least draw. This is often true, but both sides need to understand more than that.\nWith the king in front of the pawns, the side with the rook can win. Any rook move besides Rd1 wins here (because of the fork on c3).\nLet's begin with Rh1. } 2. Rh1 Ka3 { We'll look at two scenarios. First, what to do if the king comes closer.\nBegin by forcing a pawn move with Rh4. } 3. Rh4 c2+ 4. Kc1 b2+ { The king was forced to give up their pawns in this move order because mate was threatened if the black king went to a2. } 5. Kxc2 Ka2 6. Ra4# *\n\n\n"}, "12": {"Event": "Hub - Rook against 2 pawns: Pawns on the 6th - Another method", "Site": "https://lichess.org/study/dCnyOQwc/qvh5zqvm", "Result": "*", "UTCDate": "2021.05.21", "UTCTime": "19:00:59", "Variant": "Standard", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "8/8/8/8/1kp5/1p6/8/1KR5 b - - 0 1", "SetUp": "1", "pgnContent": "\n1... c3 { Let's look at a second technique if the king doesn't limit their own moves. Begin with Rh1 again. } 2. Rh1 Kc4 { Let's say that black tries to assist the pawns from the d file. Bring your rook to h8. } 3. Rh8 Kd3 { Though there are several ways to win, let's move our rook to b8 to tie the king to the b pawn. } 4. Rb8 Kd2 { A tricky move. If we capture the b pawn then our rook will be too close to the king to be able to capture the c pawn as well. We need to check the king or play c8.\nLet's choose Rd8. } 5. Rd8+ Ke3 { We can now prevent the king from assisting the pawns with Kc1. } 6. Kc1 Ke2 { Move back to threaten the b pawn now that black's king is out of position. } 7. Rb8 Kd3 8. Rxb3 Kc4 9. Kc2 *\n\n\n"}, "13": {"Event": "Hub - Rook against 2 pawns: Pawns on the 6th - Gaining Tempo", "Site": "https://lichess.org/study/dCnyOQwc/xFl2KP7S", "Result": "*", "UTCDate": "2021.05.21", "UTCTime": "19:02:50", "Variant": "Standard", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "8/8/3k4/8/6p1/5p2/8/3KR3 b - - 0 1", "SetUp": "1", "pgnContent": "\n1... g3 { Sometimes all seems lost in a rook vs two pawns endgame. I encourage you to look for creative ways to win in these scenarios and not just resign. Remember that either side can still blunder at any time.\nThe idea here is to be able to get your king to e3 so you can stop the pawns. The rook is unable to do so alone.\nWe can utilize discovery checks in order to make this happen. } 2. Kd2 f2 { If seems like both pawns will get to the 7th and we will lose. Create a discover check idea to prevent this. } 3. Rd1 Ke5 { If black had moved their second pawn to the 7th, then we would have been able to play Ke2+ and win both pawns.\nInstead, we're able to make it to e3 and move towards the backwards pawn while gaining the opposition. } 4. Ke3 g2 5. Kxf2 g1=Q+ 6. Rxg1 *\n\n\n"}, "14": {"Event": "Hub - Rook against 2 pawns: Pawns on the 6th - All is not lost", "Site": "https://lichess.org/study/dCnyOQwc/bMpGxx3Z", "Result": "*", "UTCDate": "2021.05.21", "UTCTime": "19:03:49", "Variant": "Standard", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "8/8/8/3k4/6p1/5p2/8/3KR3 b - - 0 1", "SetUp": "1", "pgnContent": "\n1... g3 { This is the same scenario, but with black's king one square closer. White is unable to employ the same discovery check idea since black will just gain the opposition and win.\nInstead, we can be sneaky and sacrifice our rook to draw. } 2. Rf1 g2 { Our rook is attacking the backwards pawn, but it must stay on the back rank to prevent the queen from materializing. Find the only drawing move. } 3. Ke1 gxf1=Q+ { We have now transposed the ending into a king and pawn vs pawn. With our king in front of the pawn and black's king behind the pawn, it is a draw.\nIf black tried to move their king closer, we would have been able to play kf2 and force black to capture the rook, leading to the same scenario. } 4. Kxf1 Ke4 5. Kf2 *\n\n\n"}, "15": {"Event": "Hub - Rook against 2 pawns: Pawns on the 6th - Where to put your rook when all seems lost", "Site": "https://lichess.org/study/dCnyOQwc/YOXiRWQd", "Result": "*", "UTCDate": "2021.05.21", "UTCTime": "19:05:07", "Variant": "Standard", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "8/8/8/7K/2kp4/4p3/8/5R2 b - - 0 1", "SetUp": "1", "pgnContent": "\n1... d3 { White' king is out of position but again all is not lost. We need to bring our king closer to the pawn and utilize checks where we can to win. } 2. Kg4 e2 { Check the king. } 3. Rc1+ Kd4 { We're now able to move our king in to position.\nNotice that all of these positions can meld together. We're now in the same \"one pawn on the 7th\" position we were in before and we know that was drawn. } 4. Kf3 d2 { The difference in this scenario from previous ones is that black was able to get both pawns to the 7th. Just remember that all is not always lost and there are hidden draws all over the place.\nFind the only drawing move that allows the king to capture both pawns. } 5. Rc4+ Kxc4 6. Kxe2 Kc3 { We now have a drawn king and pawn vs king position. } 7. Kd1 Kd3 *\n\n\n"}, "16": {"Event": "Hub - Rook against 2 pawns: Pawns on the 6th - Mating Threats", "Site": "https://lichess.org/study/dCnyOQwc/uJ7C5PQo", "Result": "*", "UTCDate": "2021.05.21", "UTCTime": "19:13:59", "Variant": "Standard", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "8/8/4R3/4K3/3p4/2p4k/8/8 b - - 0 1", "SetUp": "1", "pgnContent": "\n1... d3 { To continue to stress the point, we can always look to create mating threats when all seems lost. The king is out of position to help the pawns and we must choose which pawn to get behind.\nIf we play Rd6, then black's leading pawn will be the d pawn which will lead to a draw.\nWe can win this game by getting behind the other pawn. } 2. Rc6 c2 { We've created a leading pawn and we can not look to create mating threats. Our king is unable to move closer to the d pawn since black will obtain two pawns on the 7th and win. } 3. Kf4 d2 { Like in previous lessons, black's king does not want to be on the same rank as the pawns, so it cannot move to h2. We can use this to our advantage and instead force the king into the opposition. } 4. Rc3+ Kh4 { If the king moved to h2, then we would have captured both pawns thanks to the pin.\nWe're still able to create a mating threat and win the pawns at the same time. } 5. Rxc2 d1=Q { This is one scenario where black indeed queens, but loses the game.\nAs a side note, always keep in mind where your king is when the pawn queens to avoid forks. } 6. Rh2# *\n\n\n"}, "17": {"Event": "Hub - Rook against 2 pawns: Pawns not yet on the 6th", "Site": "https://lichess.org/study/dCnyOQwc/WAgSXy6X", "Result": "*", "UTCDate": "2021.05.21", "UTCTime": "19:15:06", "Variant": "Standard", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "8/K1k5/R7/8/5pp1/8/8/8 b - - 0 1", "SetUp": "1", "pgnContent": "\n1... g3 { We've seen many scenarios where we fight for a draw with the pawns on the 6th rank or further.\nIn many cases, the side with the rook has an advantage against two pawns that have not yet reached the 6th yet, but it always depends on the position of the kings.\nHere we are able to force a win. As always, move the rook behind the leading pawn to prevent it from moving further. } 2. Rg6 { Always go behind the further advanced pawn } 2... Kd7 { Our king is out of position, but we can win the pawns with just our rook by attacking both of the,. } 3. Rg4 { With the black king out of position the rook can attack both pawns, forcing one forward. } 3... g2 { Capture the leading pawn. } 4. Rxg2 Ke6 { Now the only question remaining is \"can I stop the lone pawn with just my rook?\"\nIf we look to our previous courses, we can see that the answer is yes! Thanks to rook endgame principle #1, we know to cut the king off. } 5. Rg5 Kf6 { With the king cut off, we just need to mark time and move our king closer. If black decides to move the pawn forward, we can capture it.\nLet's mark time with Ra5. } 6. Ra5 f3 { Now we can win the pawn. } 7. Ra3 Kf5 8. Rxf3+ *\n\n\n"}, "18": {"Event": "Hub - Rook against 2 pawns: Pawns not yet on the 6th - Bypass", "Site": "https://lichess.org/study/dCnyOQwc/R5YjBVo1", "Result": "*", "UTCDate": "2021.05.21", "UTCTime": "19:16:36", "Variant": "Standard", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "6R1/8/8/2K5/4kpp1/8/8/8 b - - 0 1", "SetUp": "1", "pgnContent": "\n1... g3 { With our rook behind the leading pawn, we just need to work to prevent the pawns getting to the 6th.\nLet's start with Kc4 to bring our king closer. } 2. Kc4 Kf3 { Most moves still win here, but let's bring our king to d4. } 3. Kd4 Kf2 { Now we just want to go after the backwards pawn with Ke4. } 4. Ke4 f3 { With the king attempting to switch the leading pawns, we have time to capture the f pawn. } 5. Rf8 g2 { We can capture the pawn and still be able to stop the g pawn. } 6. Rxf3+ Ke1 { \"Rooks belong behind passed pawns\" } 7. Rg3 Kf1 8. Rxg2 (8. Kf3) 8... Kxg2 *\n\n\n"}, "19": {"Event": "Hub - Rook against 2 pawns: Pawns not yet on the 6th - The Leading Pawn", "Site": "https://lichess.org/study/dCnyOQwc/8Sb0CTPv", "Result": "*", "UTCDate": "2021.05.21", "UTCTime": "19:18:36", "Variant": "Standard", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "8/8/5K2/5PP1/8/2k5/7r/8 w - - 0 1", "SetUp": "1", "pgnContent": "\n1. g6 { Find the only drawing move. Ensure that white cannot switch the leading pawn and must advance the current leading pawn. } 1... Rf2 2. g7 { With the king tied down to the f pawn, the g pawn must be pushed to remain the leading pawn.\nWe can now transfer our rook back behind the leading pawn. } 2... Rg2 3. Kf7 { The king needed to protect the queening square, which allows our own king to attack the backwards pawn. } 3... Kd4 4. f6 { Find the ideal drawing method by attacking the backwards pawn. } 4... Ke5 5. g8=Q Rxg8 6. Kxg8 Kxf6 *\n\n\n"}, "20": {"Event": "Hub - Rook against 2 pawns: Pawns not yet on the 6th - A unique scenario", "Site": "https://lichess.org/study/dCnyOQwc/q2DLnBaT", "Result": "*", "UTCDate": "2021.05.21", "UTCTime": "19:21:13", "Variant": "Standard", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "4k3/8/7K/8/5pp1/2R5/8/8 b - - 0 1", "SetUp": "1", "pgnContent": "\n1... f3 { What would an endgame be without a fun and unique scenario.\nThe rook is unable to get behind the leading pawn since the black king is optimally placed.\nThe king cannot move closer either since the leading pawn will move forward on its own thanks to the support of the g pawn stopping the rook from getting behind it.\nThe solution is to check the king so that the rok can transfer behind the leading pawn. } 2. Rc8+ Ke7 { The king cannot leave the e file because the rook would be able to get behind the leading pawn.\nIf Kf7, then Rc4, threatening to win the g pawn, but also to check on f4 if the f pawn tries to queen.\nIf Kd7, then the rook moves to f7 and is behind the leading pawn.\nContinue checking on the c file. } 3. Rc7+ Ke6 { Continue checking on the c file. } 4. Rc6+ Ke5 { Continue checking on the c file. } 5. Rc5+ Ke4 { Continue checking on the c file. } 6. Rc4+ Ke3 { Now we're able to capture the g pawn, but we're not out of the woods yet. The rook cannot move behind the leading pawn still. } 7. Rxg4 f2 { This is now transposing into a type of Saavedra rook endgame which we saw in a previous course. } 8. Rg3+ Ke4 { If Ke2, white draws immediately with Rg2.\nInstead, we must keep checking along the g file } 9. Rg4+ Ke5 { Keep checking along the g file } 10. Rg5+ Ke6 { Keep checking along the g file } 11. Rg6+ Ke7 { Keep checking along the g file } 12. Rg7+ Kf8 { Now we're able to win the pawn or stalemate. } 13. Rg5 f1=Q 14. Rf5+ Qxf5 *"}}}