{"rook_endgames_1v1_2v3": {"0": {"Event": "Hub - Rook and Pawns vs Rook and Pawns: Introduction", "Site": "https://lichess.org/study/ru53JEZW/kPZGrX2Z", "Result": "*", "UTCDate": "2021.05.31", "UTCTime": "14:54:48", "Variant": "Standard", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "6k1/1r6/8/6p1/2R3P1/5P1K/8/8 w - - 0 1", "SetUp": "1", "pgnContent": "\n1. Kg3 { Let's take a look at scenarios where each side has a rook and one or multiple pawns.\nMost of these scenarios are theoretical draws, but that doesn't mean they're automatically so. Often there are single moves that draw and a lot that may lose the game.\nPlay Rb5 to continue. } 1... Rb5 *\n\n\n"}, "1": {"Event": "Hub - Rook and Pawns vs Rook and Pawns: One pawn each side. Not passed pawns", "Site": "https://lichess.org/study/ru53JEZW/7JxBosVy", "Result": "*", "UTCDate": "2021.05.27", "UTCTime": "21:47:13", "Variant": "Standard", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "4R3/r7/5Kp1/7k/7P/8/8/8 b - - 0 1", "SetUp": "1", "pgnContent": "\n1... Ra6+ { First, let's look at a situation with each side having a single pawn each.\nWhat matters the most is the position of the pawns relative to each other. In this case, neither pawn is passed so a draw is often easier. No passed pawn can be created unless you're able to capture your opponent's pawn.\nKeep your composure in these situations. It looks like white is lost because of the check, protecting the g pawn, which allows the black king to win the h pawn and create a passed pawn.\nLet's play Kg7, though Kf7 accomplishes the same thing and still draws. All other moves lose. } 2. Kg7 Kxh4 { Often, these endgames may turn into previous courses we've reviewed. Now the question is whether or not black can win with the passed pawn that was created.\nIn this instance, there are three options, all accomplish the same goal: continuous checks.\nLet's play Re1 } 3. Re1 g5 { Black needs to get the pawn moving, but this leaves it unprotected.\nEither way, if the pawn stayed on g6, the white rook would be able to check the king until he moved away from the pawn, and capture the g6 pawn.\nWith the pawn forward, our king is cut off from the pawn by the rook. But since we have a lot of checking distance for our rook, we can continue to check the king until a draw is achieved. } 4. Rh1+ Kg4 { Continue to check the king until a draw is achieved. } 5. Rg1+ Kf4 { Continue to check the king until a draw is achieved. } 6. Rf1+ Ke4 { Now we need to make progress and attack the g pawn, forcing the king back to its protection, or allowing our king to move forward and double attack the pawn. } 7. Rg1 Kf5 { Continue to check the king until a draw is achieved. } 8. Rf1+ Ke4 { Attack the pawn. } 9. Rg1 Kf4 { Continue to check the king until a draw is achieved. } 10. Rf1+ *\n\n\n"}, "2": {"Event": "Hub - Rook and Pawns vs Rook and Pawns: One pawn each - gridlocked but advanced", "Site": "https://lichess.org/study/ru53JEZW/RqaTjlkd", "Result": "*", "UTCDate": "2021.06.01", "UTCTime": "16:29:05", "Variant": "Standard", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "5R2/8/r4pK1/5P2/5k2/8/8/8 b - - 0 1", "SetUp": "1", "pgnContent": "\n1... Ke5 { Let's now look at pawns that are gridlocked. As white, you'll want to achieve this superior position to win. You may also notice that without the rooks on the board, this is a trebuchet and whoever is to move loses in that situation.\nThe biggest point to note is how far advanced the f pawn is. That's why earlier in the game, you'll want to consider pushing a pawn further into your opponent's camp to work towards a situation such as this.\nBegin by checking the king. } 2. Re8+ Kf4 { A key move in rook and pawn endgames, and why you want to advance your pawn as far as you can, is to create a passed pawn by offering a rook trade. } 3. Re6 Ra1 { With the king outside of the square, black cannot possibly capture the rook. This allows you to capture the pawn immediately.\nHowever, We don't need to capture with the rook right away. Patience helps a ton in these endings.\nLet's play Rb6 to see which way black moves. } 4. Rb6 Rh1 { If black played Ke5 right away, we would be able to check on b5 and create a Lucena position.\nWe have to be careful about capturing the pawn. This would lead to a draw as black has the skewer as a resource with Rh6. } 5. Rb4+ Ke5 { We're able to get in the move Rb5 now with a tempo on the king. We want to capture the f6 pawn with our king to create a lucena. } 6. Rb5+ Kd6 { Capture the pawn to enter the Lucena scenario. } 7. Kxf6 *\n\n\n"}, "3": {"Event": "Hub - Rook and Pawns vs Rook and Pawns: One pawn transposing into Philidor", "Site": "https://lichess.org/study/ru53JEZW/Bw3ND6x5", "Result": "*", "UTCDate": "2021.05.27", "UTCTime": "22:46:16", "Variant": "Standard", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "4k3/1R6/5pK1/5P2/r7/8/8/8 b - - 0 1", "SetUp": "1", "pgnContent": "\n1... Ra6 { Black has just blundered. He should have played Kf8 to enter a favorable Philidor scenario where his king can go to the short side and draw.\nHow can white stop black's plan of Kf8? } 2. Kg7 Rc6 { Now with our king optimally placed, we can better improve our rook with Rb8 to kick the king off the back rank. } 3. Rb8+ Ke7 { Now that the black king has shielded our own king from checks. We can swing our rook over to the e file with Rb1. } 4. Rb1 Ra6 { With the opposition, we can force the king away. } 5. Re1+ Kd8 { Now let's get our king in to position. Eventually we will be able to win the pawn or play Re6 to create a passed pawn with our king in the dream square. } 6. Kf7 Kd7 { Multiple moves win here. Let's play keep with the theme of entering a Lucena or a passed pawn with Re6. } 7. Re6 Ra3 { Capture the pawn with your king to enter the Lucena. } (7... Rxe6 { With our king in the dream square, we can capture with check and queen long before black's pawn can even think of becoming a queen. } 8. fxe6+) 8. Kxf6 *\n\n\n"}, "4": {"Event": "Hub - Rook and Pawns vs Rook and Pawns: Rook and pawn - Each pawn is passed", "Site": "https://lichess.org/study/ru53JEZW/NfxdJt4y", "Result": "*", "UTCDate": "2021.05.27", "UTCTime": "22:55:42", "Variant": "Standard", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "4r3/2P5/3K2p1/8/5k2/8/8/2R5 b - - 0 1", "SetUp": "1", "pgnContent": "\n1... g5 { With each side both having passed pawns, the question often centers around which rook will need to sacrifice itself first. And after this sacrifice, does the passed pawn vs rook win or draw as we've seen in previous lessons.\nWith the white pawn so far advanced, we'll be able to get a queen, but will black's pawn be able to queen?\nStart by checking the king to gain space and see if black makes an error. } 2. Rf1+ Kg3 { Black played correctly and went in front of the pawn, which is counter intuitive. Moving to the e file loses since the king is cut off from the pawn, but more importantly because the king would put itself into a skewer to the rook on e8.\nKeep checking the king. } 3. Rg1+ Kf4 { With black's pawn not far advanced and the white rook in place, we can force black to trade their rook for our pawn. } 4. Kd7 Rg8 { Force black to trade their rook for our pawn. } 5. c8=Q Rxc8 6. Kxc8 g4 { With white's king so far our of position, white has no chance of winning and can just sacrifice the rook right away to end the game with a draw. } 7. Rxg4+ *\n\n\n"}, "5": {"Event": "Hub - Rook and Pawns vs Rook and Pawns: Rook and pawn - Each pawn is passed 2", "Site": "https://lichess.org/study/ru53JEZW/j8VJuSwO", "Result": "*", "UTCDate": "2021.05.28", "UTCTime": "02:24:43", "Variant": "Standard", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "3r4/8/1PK2p2/5k2/8/8/8/1R6 b - - 0 1", "SetUp": "1", "pgnContent": "\n1... Ke4 { Alekine Bugoljubow 1929\nBlack just played the only move to draw the game. Contrary to the previous example, it's important to see the black's king needs to be able to shoulder the white king and prevent it from coming closer to the pawn.\nIf black played Kg4, white could put the pawn to queen and capture with the rook, which would allow Kd5, getting closer to the pawn.\nSince black played correctly, we need to create the same scenario we just saw by advancing our pawn, and getting our took behind the pawn in an attempt to draw. } 2. b7 f5 3. b8=Q Rxb8 4. Rxb8 f4 { The difference in this example is that our king is closer to the pawn, but the rook will be behind the pawn. Just one extra tempo would turn this into a win for white.\nLet's move our king closer. Notice how Kd5 is unavailable thanks to black's move that saved the game. } 5. Kc5 f3 { Move your rook behind the pawn. } 6. Rf8 Ke3 { Move the king closer } 7. Kc4 f2 { Move the king closer } 8. Kc3 Ke2 { Move the king closer } 9. Kc2 f1=Q 10. Rxf1 *\n\n\n"}, "6": {"Event": "Hub - Rook and Pawns vs Rook and Pawns: Rook and 2 pawns vs Rook and King", "Site": "https://lichess.org/study/ru53JEZW/ByTmu4IK", "Result": "*", "UTCDate": "2021.05.31", "UTCTime": "14:22:41", "Variant": "From Position", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "8/8/1r4k1/4R3/5K1P/6P1/8/8 b - - 0 1", "SetUp": "1", "pgnContent": "\n1... Rb4+ { Before we move into multiple pawns, it's important to know how to win with a rook and 2 pawns vs rook and king. This could end in a draw if you're unsure the winning methods.\nThe goal is to advance the pawns, but keep your king safe from checks from the rook.\nUse the fact that trading rooks would still lose the game for black as we've seen in our pawn endgames course. } 2. Re4 Rb6 { We can safely start advancing our pawns. They need to move together and one cannot queen alone. } 3. g4 Rf6+ 4. Kg3 Rb6 { Now we can check the king and make progress with our king on the h file. } 5. h5+ Kg5 { Make progress with your king towards the h file. } 6. Re5+ Kh6 { Make progress with your king towards the h file. } 7. Kh4 Rb4 { Check the King } 8. Re6+ Kh7 { Black will try to keep your pawns pinned. Let's play h6. } 9. h6 Rd4 { Bring the king up to h5 so the pawn can block from side checks. } 10. Kh5 Rd5+ 11. g5 Rb5 12. Re7+ Kg8 { You can repeat this pattern of checking the king and moving up the board, but now Kg6 is trickier. It wins, but let's play Kg4 to show that our goal is just to transfer our king to the other side so we can block checks from the side with our rook. } 13. Kg4 Rb4+ 14. Kf5 Rb5+ { Move the king so we can block checks from the side. } 15. Kf6 Rb1 { Black gave up the fight and we can win in three moves a few ways. Let's do so by trying to promote the h pawn. } 16. h7+ Kf8 (16... Kh8 { Force black to capture the pawn so we can win with a rook checkmate. } 17. Re8+ Kxh7 18. g6+ Kh6 19. Rh8#) 17. h8=Q# *\n\n\n"}, "7": {"Event": "Hub - Rook and Pawns vs Rook and Pawns: Rook and 2 pawns vs Rook and pawn", "Site": "https://lichess.org/study/ru53JEZW/Y42005BK", "Result": "*", "UTCDate": "2021.05.28", "UTCTime": "20:45:04", "Variant": "From Position", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "8/8/1r4k1/4R2p/7P/5KP1/8/8 w - - 0 1", "SetUp": "1", "pgnContent": "\n1. Kf4 { Let's move on to a rook and 2 pawns vs rook and 1 pawn.\nThe goal for white is to either win the other pawn, resulting in a won 2 pawn and rook vs rook and king endgame, or trade pawns and enter a winning Lucena.\nThis goal is hard to achieve and the position of the pawns here does not help white.\nLet's play Ra6. } 1... Ra6 2. Re3 { Gain the opposition with Kf6. } 2... Kf6 3. Re4 { Let's repeat with Rb6. Our goal is to prove that white cannot make any progress in this position. } 3... Rb6 4. Rd4 { Repeat with Ra6. } 4... Ra6 5. Rd5 { Bring the king back to g6. } 5... Kg6 6. Ke5 { White is trying to create a scenario where he can force the exchange of rooks and try to win the h pawn. Let's create a counter threat by attacking the backwards pawn. } 6... Ra3 7. Rd6+ { Move to kf7. } 7... Kf7 8. Kf4 { Check the king. } 8... Ra4+ 9. Kf3 { Play Rb4 to keep the king on the third rank and protect against g4.\nNeither side was able to make progress in this scenario. } 9... Rb4 *\n\n\n"}, "8": {"Event": "Hub - Rook and Pawns vs Rook and Pawns: 2 pawns vs 1", "Site": "https://lichess.org/study/ru53JEZW/1Km1FZs2", "Result": "*", "UTCDate": "2021.05.31", "UTCTime": "14:39:27", "Variant": "From Position", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "8/2r2kp1/8/5PP1/1R4K1/8/8/8 b - - 0 1", "SetUp": "1", "pgnContent": "\n1... Ra7 { When we have two pawns, the key is often to create a passed pawn. If we can sacrifice one pawn to create a passed pawn, that pawn can help give us shelter sometimes.\nTo create this opportunity, we need to first stop black from playing g6 himself.\nLet's play Kh5, but know that Rb6 accomplishes the same thing. } 2. Kh5 Rc7 { We now want to keep the king from going to the back rank with Rb8. Several other moves also win. } 3. Rb8 Ra7 { Now let's work on creating our passed pawn.\nA key method in a lot of instances of creating a passed pawn is to first advance one pawn as far as it can go, and then break the pawn in front of it. } 4. g6+ Kf6 { Now we can check the king and protect our f pawn. } 5. Rf8+ Ke5 { Now we're able to create a pawn break. } 6. f6 gxf6 { Before we advance our pawn, which would be captured, we need to protect the pawn's advancement with our king. } 7. Kh6 Ra1 { Advance the pawn. } 8. g7 Rh1+ { We can now use the f pawn as shelter and win the game. } 9. Kg6 Rg1+ { We can now use the f pawn as shelter and win the game. } 10. Kf7 *\n\n\n"}, "9": {"Event": "Hub - Rook and Pawns vs Rook and Pawns: 2 Passed Pawn and Rook vs 1 Passed Pawn and Rook", "Site": "https://lichess.org/study/ru53JEZW/R9lqpoiH", "Result": "*", "UTCDate": "2021.05.31", "UTCTime": "14:44:09", "Variant": "From Position", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "7R/8/3p4/2pk3P/8/2K5/5r2/8 b - - 0 1", "SetUp": "1", "pgnContent": "\n1... Rf4 { At first glance, it's scary to have the white pieces. However, our king is perfectly placed in front of the pawn. If we can trade our passed pawn for one of black's pawns, we will be able to draw the game.\nStart by creating threats and advancing the pawn. } 2. h6 Rf3+ { Any move draws. Let's move to Kc2. } 3. Kc2 c4 { Advance your pawn. } 4. h7 Rf7 { We need to keep black from coordinating his pawns and attack it at the same time. } 5. Kc3 Re7 { Now we're able to win the more advanced c pawn since it is cut off from the d pawn.\nLet's move to Rg8. } 6. Rg8 Rxh7 { Check the king so he must abandon the pawn. } 7. Rg5+ Ke4 { Capturing the pawn draws, but black can cut your king off and create a tougher way to draw.\nSafer is Rg4 first so the white king can stay in front of the pawn. } 8. Rg4+ Ke5 { Capture the pawn with the king. } 9. Kxc4 d5+ { Stay in front of the pawn. } 10. Kd3 *\n\n\n"}, "10": {"Event": "Hub - Rook and Pawns vs Rook and Pawns: 3 v 2 - Botvinnik v Boleslavsky 1941", "Site": "https://lichess.org/study/ru53JEZW/om8yLsXv", "Result": "*", "UTCDate": "2021.05.31", "UTCTime": "14:59:36", "Variant": "From Position", "ECO": "?", "Opening": "?", "Annotator": "https://lichess.org/@/ragnarok5375", "FEN": "6r1/1k4pp/1P2R3/8/6K1/7P/6P1/8 b - - 0 1", "SetUp": "1", "pgnContent": "\n1... Ka6 { To transition into the next course, let's look at a scenario with 3 vs 2, one pawn is passed.\nWhite's rook is optimally placed protecting the pawn from the side, but also controlling what happens with the pawns on the king side.\nBlack has to keep their rook passively placed on g8 while black's king is forced to just play back and forth from a6 to b7.\nMeanwhile, white starts advancing their pawns, starting with the H pawn.\nStart with Kg5 to limit black's pawn movements. } 2. Kg5 Kb7 { Starts advancing the pawns, starting with the H pawn. } 3. h4 Ka6 { Starts advancing the pawns, starting with the H pawn. } 4. h5 Kb7 { Advance the g pawn. } 5. g4 Ka6 { Now we want to create a passed pawn thanks to our space advantage. We need our king out of the way first. } 6. Kh4 Kb7 { Which pawn do we advance? } 7. h6 gxh6 { If black had played g6, we would have an advantage on the dark squares and we could win the h7 pawn and the game. } 8. Rxh6 Rg7 { Black's limited moves are all forced. Let's develop our king further. } 9. Kh5 Ka6 { We can now create a threat if black moves back to b7. Our threat is to force the trade of rooks. } 10. Rc6 Re7 { Let's win the h pawn with the same threat we sought out. } 11. Rc7 Re5+ 12. g5 Kxb6 { We can now win the h pawn and black's king is 5 files away. This will result in a winning Lucena position. } 13. Rxh7 *"}}}