{
    "ruy_lopez_closed": {
        "0": {
            "Event": "Ruy Lopez: Closed: The Ruy Lopez Pawn Structure",
            "Site": "https://lichess.org/study/N3jujWJ9/akxTS2c8",
            "Result": "*",
            "UTCDate": "2021.06.15",
            "UTCTime": "19:21:43",
            "Variant": "Standard",
            "ECO": "?",
            "Opening": "?",
            "Annotator": "https://lichess.org/@/ragnarok5375",
            "FEN": "6k1/ppp2ppp/3p4/4p3/3PP3/2P5/PP3PPP/6K1 b - - 0 1",
            "SetUp": "1",
            "pgnContent": "\n1... c5 { This course will allow you to play every move that famous Grandmasters have played, with each move revealed to the right. Commentary has been added where applicable to further explain the move. The essence of the openings has been covered under the Ruy Lopez Introduction course.\nThis pawn structure almost always stems from the Ruy Lopez opening.\nWhite's possible plans are to advance d4-d5 and later c3-c4, transposing into a King's Indian Structure under favorable circumstances.\nBlack can respond with c5-c4 which will be covered most famously with Karpov-Unzicker 1974.\nWhite can also capture e5 or c5 and transpose into a King's Indian structure.\nBlack can capture c5xd4 and turn the position into a King's Indian structure.\nPlay Kf1 to move on to the first game. } 2. Kf1 *\n\n\n"
        },
        "1": {
            "Event": "Ruy Lopez: Anatoly Karpov - Wolfgang Unzicker 1974",
            "Site": "reveal all moves",
            "Date": "1974.05.03",
            "White": "Anatoly Karpov (?)",
            "Black": "Wolfgang Unzicker (?)",
            "Result": "1-0",
            "TimeControl": "-",
            "Termination": "Normal",
            "UTCDate": "2021.06.15",
            "UTCTime": "18:34:40",
            "Variant": "Standard",
            "ECO": "C98",
            "FEN": "rnbqkbnr/pppppppp/8/8/4P3/8/PPPP1PPP/RNBQKBNR b KQkq - 0 1",
            "Opening": "Ruy Lopez: Closed, Chigorin Defense",
            "Annotator": "https://lichess.org/@/ragnarok5375",
            "pgnContent": "\n1... e5 { Begin by playing through the moves we learned in the Ruy Lopez Closed section of the Ruy Lopez Introduction course.\nThe moves are mentioned in the description. Each game will start from the beginning so you can recognize the subtle nuances of each game and how they all end up in the same place.\nNote that not all moves have commentary. If you feel that there should be commentary or something is unclear, please provide us feedback and we will be happy to make any lesson more clear. } 2. Nf3 Nc6 3. Bb5 a6 4. Ba4 Nf6 5. O-O Be7 6. Re1 b5 7. Bb3 d6 8. c3 O-O { White needs to prevent the annoying Bg4 and limit black's activity. } 9. h3 Na5 10. Bc2 c5 { Also known as the Chigorin Defense for black. White should challenge the center right away. } 11. d4 Qc7 { It's important to keep pawn tension where possible. There is no rush to capture on either c5 or e5 for white.\nInstead, development is important and white can develop the knight now since black's knight is unable to support d4 from c6. } 12. Nbd2 Nc6 { Transform the position into a closed Ruy Lopez pawn formation.\nWhite's plans are to open the a file with a4, but also create a kingside attack with an eventual f4-f5 and focus on maneuvering the knights. } 13. d5 { [%cal Gc6b8] } 13... Nd8 { The knight to d8 clogs up all of black's pieces and limits the knights activity. Better is Nb8. This was a key mistake in 1974 and led to this line virtually disappearing from top level games.\nWatch how the knight on d8 totally disrupts the flow of all of black's pieces throughout the game.\nWe can continue our plan with a queen side expansion. } 14. a4 Rb8 15. axb5 axb5 { Let's shut down the last rook move by black. } 16. b4 Nb7 { If black captures the b pawn and opens the position a little, it exposes the weakness of black's side. Most importantly the b5 pawn that white can exploit after Bd3 and Qe2.\nWe want to begin maneuvering our knight to the kingside and allowing our bishop on c1 to develop. } 17. Nf1 Bd7 18. Be3 Ra8 19. Qd2 Rfc8 { Black is threatening to open the c file and win a piece or a pawn. We need to move our bishop out of the way. } { [%cal Gc7c2] } 20. Bd3 g6 { Our knight is not helping us on the backrank, so we want to bring it to g3 in typical Ruy Lopez fashion.\ng6 blocks the knight from coming forward for now, but the knight is still move helpful on g3 than is it on the backrank. } 21. Ng3 Bf8 { Karpov next begins to double the rooks on the a file. } 22. Ra2 c4 { Black has now locked down the pawns and thus all counterplay and activity is solely on the kingside.\nThe bishop needs to move, but it still needs to keep an eye on f5 to prevent a possible pawn break and opening of the position for black. } { [%csl Gf5] } 23. Bb1 Qd8 { Find the killer move that completely locks in the position.\nThe thought process is a blockade in which black cannot maintain control of the A file nor make use of his own dark-squared bishop. } 24. Ba7 Ne8 { Karpov completely controls the A file.\nThe center is closed and there's no way to help attack the bishop on a7, where it remains the entire game.\nWe now want to begin maneuvering our other rook to the a file. } 25. Bc2 Nc7 26. Rea1 Qe7 { Black has no activity and can only wait to see what black does. White has time to keep maneuvering his pieces and improving them. Remember white's bishop needs to keep an eye on f5. } { [%csl Gf5] } 27. Bb1 Be8 { It's time to start maneuvering our knights out of the way so we can advance our kingside pawns and begin advancing our pawns and exposing the black king } 28. Ne2 Nd8 29. Nh2 Bg7 30. f4 f6 { Black was unable to capture on f4 as this allows nxf4 Bh6 nxg6 BxQ followed by BxQ+, winning the exchange on c8.\nContinue expanding on the kingside with your pawns and working off of black's weakened pawn structure. } 31. f5 g5 { Karpov controls the only open file and has a locked-down position. The only step next is to take advantage of the light squares since black's pawns on the kingside pawns are almost all on dark squares.\nKarpov's plans are to play on the light squares and avoid moving any more pawns on the kingside. } { [%csl Gb4,Gc3,Gd5,Ge4,Gf5][%cal Gb1c2,Gc2d1,Gd1h5] } 32. Bc2 Bf7 33. Ng3 Nb7 34. Bd1 h6 { Black has given up on trying to open the position and is hoping white cannot do anything more than hope for a draw.\nBlack's dark-squared bishop can do nothing in this game anymore.\nBlack's light-squared bishop is the best defender, so Karpov works to trade it off. } { [%csl Gg7] } 35. Bh5 Qe8 36. Qd1 Nd8 { The next few moves are close to the 40 moves to meet time control. Karpov is able to simply wait a few moves and waste time, only slightly improving his pieces. } 37. Ra3 Kf8 38. R1a2 Kg8 39. Ng4 Kf8 { Tactically, black cannot capture the bishop on h5.\nBxh5 nxh5 Qxh5 Nxf6 Bxf6 Qxh5 } 40. Ne3 Kg8 41. Bxf7+ Nxf7 42. Qh5 Nd8 43. Qg6 Qxg6 { It may seem weird to offer a trade of queens, but Karpov wants to bring the knights in to f5 and build more pressure on the backwards pawns on d6 and h6.\nThe game ended next with Nh5 and black resigned.\nHowever, we'll allow you to play through the game if black had decided to trade queens. This will run through one potential line. } 44. fxg6 { [%csl Gg7][%cal Gg3h5,Ge3f5,Gf5h6] } 44... Ne8 45. Nef5 Bf8 46. Ra5 Nc7 47. Bb6 Rxa5 48. Rxa5 Ne8 49. Ra7 Rb8 50. Rd7 Nb7 51. Ba7 Nd8 52. Bxb8 1-0\n\n\n"
        },
        "2": {
            "Event": "Ruy Lopez: Ivan Eduardo Morovic-Fernandez - Fadi Eid",
            "Site": "reveal all moves",
            "Date": "2010.09.28",
            "Round": "7",
            "White": "Ivan Eduardo Morovic-Fernandez",
            "Black": "Fadi Eid",
            "Result": "1-0",
            "WhiteElo": "2580",
            "BlackElo": "2387",
            "UTCDate": "2021.06.15",
            "UTCTime": "19:11:07",
            "Variant": "Standard",
            "ECO": "C97",
            "FEN": "rnbqkbnr/pppppppp/8/8/8/5N2/PPPPPPPP/RNBQKB1R b KQkq - 0 1",
            "Opening": "Ruy Lopez: Closed, Chigorin Defense",
            "Annotator": "https://lichess.org/@/ragnarok5375",
            "pgnContent": "\n1... Nc6 { The moves are mentioned in the description. Each game will start from the beginning so you can recognize the subtle nuances of each game and how they all end up in the same place. } 2. e4 e5 3. Bb5 a6 4. Ba4 Nf6 5. O-O Be7 6. Re1 b5 7. Bb3 d6 8. c3 O-O { White's goal should be to limit black's piece movement and the annoying pin on g4. } 9. h3 Na5 { Where possible, you should preserve the bishop pair.\nBlack's last move allows c5 with tempo on the bishop, transposing into the Chigorin pawn structure. } 10. Bc2 c5 11. d4 Qc7 { White chooses to close the center and avoid theory in this game. } 12. d5 c4 { This is a mistake and a premature pawn move that ends up being black's downfall this game. Black should simply develop with Bd7.\nThe next move forces black to give up active play on the queenside.\nWhite's plans on the queenside are simply beautiful in this game thanks to the space advantage afforded by the move d5. } 13. b4 cxb3 14. axb3 Bd7 { White can create a threat on the a3-f8 diagonal before later repositioning the bishop to the more natural e3 square. } 15. Ba3 { [%cal Gf3e5] } 15... Bd8 { White was threatening Nxe5 with an x-ray on the bishop on d7, winning a pawn.\nIf black tries to play Nfe8 then white can win tactically with:\nNxe5 dxe5 Bxe7 Rxe7 d6\nWhite's plan now is to lock down the queenside with b4, prevent the knight from coming in to c4, and clearing space for the e1 rook to come to a2. } 16. Bd3 Nb7 { With the knight retreating, it's important to stop any queenside counter play and keep the knight from c5. The dark-squared bishop has done its job on the a3-f8 diagonal and white can close the diagonal now. } 17. b4 Be7 18. Bc1 Rfc8 { Similar to the Karpov game, we want to double our rooks on the A file. The simplest way is Re2-A2. } 19. Re2 a5 20. Rea2 Qd8 21. Be3 axb4 { We mentioned in the last lesson that capturing on b4 would weaken the b5 pawn. This game further shows how true that point is. } { [%csl Gb5] } 22. cxb4 Rxa2 23. Rxa2 Ra8 24. Qe2 g6 25. Nc3 Rxa2 26. Qxa2 Qc7 27. Nxb5 Bxb5 28. Bxb5 Nxe4 { Take advantage of the weak knight on b7. } 29. Qa7 { 1-0 Black resigns. } 1-0\n\n\n"
        },
        "3": {
            "Event": "Ruy Lopez: Topalov, Veselin (2812) - Ivanchuk, Vassily (2746)",
            "Site": "reveal all moves",
            "Date": "2016.06.17",
            "White": "Topalov, Veselin (2812)",
            "Black": "Ivanchuk, Vassily (2746)",
            "Result": "1-0",
            "TimeControl": "-",
            "Termination": "Unknown",
            "UTCDate": "2021.06.15",
            "UTCTime": "19:13:13",
            "Variant": "Standard",
            "ECO": "C97",
            "FEN": "rnbqkbnr/pppppppp/8/8/4P3/8/PPPP1PPP/RNBQKBNR b KQkq - 0 1",
            "Opening": "Ruy Lopez: Closed, Chigorin Defense",
            "Annotator": "https://lichess.org/@/ragnarok5375",
            "pgnContent": "\n1... e5 { The moves are mentioned in the description. Each game will start from the beginning so you can recognize the subtle nuances of each game and how they all end up in the same place. } 2. Nf3 Nc6 3. Bb5 a6 4. Ba4 Nf6 5. O-O Be7 6. Re1 b5 7. Bb3 d6 8. c3 O-O 9. h3 Na5 10. Bc2 c5 11. d4 Qc7 12. d5 Bd7 { This game has mirrored the last, with this exception. We mentioned the bishop coming to d7 was better for black instead of c4, creating queenside weaknesses.\nBlack has completed development and has a good amount of space. The only limitation is the c6 square for black that white can potentially put a knight or bishop on later. Bd7 helps control this square in the future and finishes black's development. } 13. b3 c4 { The situation is slightly different with the bishop already on d7. Playing b4 is an option, but creates a perpetual weakness on d3 that black may be able to expose at some point. Better than pushing the pawn is to maneuver pieces around the new dark square weaknesses. } 14. Ba3 Bd8 { The same threat had to be avoided of Nxe5 from the last lesson. } 15. Nbd2 Ne8 { Note that cxb3 does not win the c3 pawn as the pawn on d6 is hanging and black has to spend a move defending this key pawn. } 16. Bb4 cxb3 17. axb3 Nb7 18. Qe2 Qb8 { Note that the rook on a1 was undefended, which makes it hard to push a5 followed by b4. } 19. Ba3 Bb6 { All of the moves played revolve around the same ideas as the last game. White's goals are to lock down the queenside with an eventual b4, and then repositioning the dark squared bishop to e3 or the kingside.\nThis type of play helps to limit the knight on b7 from helping out in the game. } 20. b4 Nc7 21. Bd3 a5 22. Nf1 axb4 { White should keep a pawn on b4 to continue to prevent black's pieces from being active. } 23. cxb4 f6 24. Ne3 g6 25. Bb2 Rxa1 26. Rxa1 Nd8 { With the pawns on the queenside locked, both players shift their goals to the kingside.\nWhite's goal is to play an eventual f4 which must be prepared with moves like Nd2, Rf1, and Kh2\nIt makes sense to move the rook from the a file because there are no targets right now. It can always shift back over when needed. } 27. Nd2 Nf7 28. Kh2 Qd8 29. Rf1 Qe7 30. Bc1 Ra8 { While play has shifted to the kingside, the b5 pawn still remains weak and white makes strides to expose it. } 31. Nb1 Bd4 32. Nc2 Bb6 33. Nc3 f5 { The b5 pawn is now able to be captured, but white opts to capture the f pawn first in this game, followed by f4. } 34. exf5 gxf5 { Note that the black queen is now under an xray from the white queen after exf5. White can safely play f4 to open the center now for the potential passed d pawn. } 35. f4 Rc8 36. Be3 Bxe3 37. Qxe3 Ne8 { White is unable to capture the pawn on b5 since the c2 knight is hanging and must consolidate their pieces first. } 38. Be2 Qf6 39. Qd2 exf4 { White has to worry about the discovered double attack on the c3 knight. The pawn on f4 cannot be protected by black so there is no rush. } 40. Nd4 Qe5 41. Bxb5 f3+ 42. Kg1 Bxb5 43. Ncxb5 fxg2 { It's time to activate the rook and take advantage of the activity of the white pieces. } 44. Rxf5 Qe4 45. Nc3 Qh4 46. Qxg2+ Kh8 { Capturing the knight on f7 allows the queen to capture d5 with check.\nBest is Ne6, though Veselin played differently in the game. } 47. Nce2 Nf6 48. Rf4 Qh6 { Best here is Qf1 to win one of the two knights and avoid the rook pinning the queen to the king on g8. } 49. Nf5 Qf8 50. Ned4 Ne5 { Best is Ne6 to continue with the attack and take advantage of the outpost. } 51. b5 Qg8 52. Ne7 Rc1+ 53. Kh2 Qxg2+ 54. Kxg2 Nfd7 55. Ndf5 Nc4 56. Rg4 Nf6 57. Rg3 Rc2+ 58. Kg1 Rc1+ 59. Kh2 Rc2+ 60. Rg2 Rxg2+ 61. Kxg2 Ne4 62. Nc8 Nc3 63. Ncxd6 Nb6 64. Ne3 Kg7 65. Kf3 Kf8 66. Kf4 Ke7 67. Ndc4 Nxc4 68. Nxc4 Nxd5+ 69. Kg5 Kd7 70. h4 Ne7 71. Kf6 Ng6 { Find a way to force a win and trade minor pieces. } 72. Ne5+ Nxe5 73. Kxe5 Kc7 74. h5 Kb6 75. Kf6 Kxb5 76. Kg7 Ka4 77. Kxh7 Kb3 78. h6 Ka2 79. Kg6 Kb1 80. h7 Kc2 81. h8=Q { 1-0 White wins. } 1-0\n\n\n"
        },
        "4": {
            "Event": "Ruy Lopez: David Navara Ivan Sokolov Reykjavik 2012",
            "Site": "reveal all moves",
            "Date": "2012.03.10",
            "Round": "5",
            "White": "David Navara",
            "Black": "Ivan Sokolov",
            "Result": "0-1",
            "WhiteElo": "2700",
            "BlackElo": "2653",
            "UTCDate": "2021.06.15",
            "UTCTime": "19:27:30",
            "Variant": "Standard",
            "ECO": "C79",
            "FEN": "rnbqkbnr/pppppppp/8/8/8/8/PPPPPPPP/RNBQKBNR w KQkq - 0 1",
            "Opening": "Ruy Lopez: Morphy Defense, Steinitz Deferred",
            "Annotator": "https://lichess.org/@/ragnarok5375",
            "pgnContent": "\n1. e4 e5 { The moves are mentioned in the description. Each game will start from the beginning so you can recognize the subtle nuances of each game and how they all end up in the same place. } 2. Nf3 Nc6 3. Bb5 a6 4. Ba4 d6 5. O-O Nf6 6. Re1 Bd7 7. c3 { Our previous games started with b5. In this version, black opts for a fianchetto of the dark squared bishop since it didn't really accomplish much for black in the previous games. } 7... g6 8. d4 b5 9. Bb3 Bg7 10. Bg5 { This is the beginning of a bad plan for white. Better is h3 and continuing on the main lines. } 10... O-O 11. Nbd2 Re8 12. h3 h6 13. Bh4 { The dark-squared bishop is not well placed on h4 and is better on c1.\nWith the dark squared bishop out of play, it makes sense for black to transition into a desired version of the Chigorin pawn structure. } 13... Na5 14. Bc2 { Black is more well prepared than previous games for a closed Ruy Lopez formation. Playing c5 now, black will not have the slow suffocation that was seen in Karpov v Unzicker.\nAfter Qc7, the pin is lifted and the dark-squared bishop is doing nothing on h4.\nThis game shows what black can expect after capturing on d4 with both the e5 and c5 pawns. The d6 pawn will be backwards, but the question is whether or not black's pieces will have more activity or not. } 14... c5 15. Nb3 cxd4 16. Nxa5 Qxa5 17. cxd4 { Black can now open the position and the long diagonal. Black has much better piece activity in this game. White's pieces are uncoordinated. } 17... exd4 18. Nxd4 Qb6 19. Nf3 { White should have a long term strength thanks to the backwards and isolated d6 pawn, but it doesn't pan out that way in the game.\nSince black's pieces are better coordinated and can take advantage of the position sooner rather than waiting around for white to find coordination, black has an edge.\nBlack's bishop has the open long diagonal and white's bishop is useless on h4 still. } 19... Be6 20. Nd4 { Black can remaneuver the light-squared bishop to b7 where it hits the weakened e4 pawn. } 20... Bc8 { [%cal Gc8b7] } 21. Qd2 Bb7 22. Bxf6 Bxf6 23. Rad1 { Black can now toss away the weak d6 pawn and completely open the board up for the amazing bishop pair. } 23... d5 24. Bb3 { White is unable to capture d5 thanks to exd5 Rxe1 Rxe1 Bxd4, winning a minor piece. } 24... Rxe4 25. Rxe4 dxe4 26. Nf5 { Capturing the knight allows white to draw or gain an advantage thanks to the pin on the f7 pawn from the b3 bishop.\nAn example would be gxf5 Qxh6 Bd5 Qg5+ Kh8 Qh5+ with a draw. If the king moves to f8 then f5 is hanging and white gets two pawn for the knight and black has an exposed king. } 26... Rd8 27. Nxh6+ Kg7 28. Qc1 Rxd1+ 29. Bxd1 { Black can win the pawn back thank to the advanced e pawn being able to cut off the protection of the knight from the queen. } 29... e3 30. Ng4 exf2+ 31. Kf1 { Capturing the pawn on f2 with the knight allows black a ton of initiative with Qe6 followed by Qe2. } 31... Bd4 32. Qh6+ Kg8 33. Qf4 Qc6 34. Bf3 { Checkmate was threatened on g2. } 34... Qc4+ 35. Be2 { We can win a key pawn by trading our light squared bishop and controlling the queening square for our pawn. } 35... Bxg2+ 36. Kxg2 Qxe2 37. Nh6+ Kh7 { 0-1 White resigns. } 0-1"
        }
    }
}
